content/notas/IA/Notas.org
#+title: Inteligencia Artificial
#+author: Erik Rangel Limón
#+startup: content
#+startup: latexpreview

* Bibliografía

  - Russell y Morvig. Artificial Intelligence 4ta ed.

  - Joshi. Artificial Intelligence with python.
  
* Evaluación

  | Rubro       | Porcentaje |
  |-------------+------------|
  | 3 Exámenes  |         50 |
  |-------------+------------|
  | 3 Tareas y  |            |
  | 3 Prácticas |         50 |

  Hay una reposición. Se tomará la calificación más alta.

  Cada día de entrega tardía será penalizado con 1 pt.

* Notas de Clase

** Clase 1

*** Temario

    1. Introducción

       1.1 Definición de IA

       1.2 Marco histórico

       1.3 Aplicaciones

       1.4 Consideraciones éticas

    2. Agentes racionales

       2.1 Definición

       2.2 Entorno / Ambiente

       2.3 Estructura de Agentes

    3. Búsqueda

       3.1 Búsqueda desinformada y heurística

       3.2 Búsqueda por optimización

       3.3 Algoritmos genéticos

    4. Modelos probabilísticos

       4.1 Modelos gráficos

       4.2 Redes Bayesianas: Bayes naive, HMM

       4.3 Procesos de decisión markoviana

    5. Aprendizaje automático

       5.1 Teoría del aprendizaje

       5.2 Aprendizaje supervisado, no supervisado, por refuerzo

       5.3 Modelos paramétricos y no-paramétricos

       5.4 Aprendizaje profundo

*** Inteligencia Artificial

    La inteligencia es un atributo humano que consiste de un proceso
    para resolver problemas de manera racional.
    
    La IA estudia y dearrolla entidades (artificiales) inteligentes.

    Existen diferentes perspectivas de la inteligencia. Humano y
    Racional.

    Racional $\subset$ Humano

    De manera interna podemos identificar un rubro interno, que
    corresponde al pensamiento, mientras que el externo el
    comportamiento.

    |                     | Humano         | Racional  |
    |---------------------+----------------+-----------|
    | Int. Pensamiento    | Ciencias       | Lógica    |
    |                     | cognitivas     |           |
    |---------------------+----------------+-----------|
    | Ext. Comportamiento | Test de Turing | Teoría de |
    |                     |                | agente    |

*** Test de Turing

    Es una prueba en donde participan dos entidades, un humano y una
    computadora. Estos se comunican con un juez, y éste juez debe
    determinar quién de estas dos entidades es un humano.

*** Teoría de agente

    * Agente: Es una entidad que puede actuar de manera autónoma.

      Éste agente comienza en un estado inicial y puede cambiar de
      estado hasta llegar a un estado final por medio de las acciones
      permitidas en un ambiente.

      
** Clase 2
   
