notas/IA/Notas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-17 Thu 15:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Inteligencia Artificial</title>
<meta name="author" content="Erik Rangel Limón" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Inteligencia Artificial</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6be8838">Bibliografía</a></li>
<li><a href="#org277f7a3">Evaluación</a></li>
<li><a href="#org48a4a82">Notas de Clase</a>
<ul>
<li><a href="#org77a080c">Clase 1</a>
<ul>
<li><a href="#org05f75fe">Temario</a></li>
<li><a href="#org60a252b">Inteligencia Artificial</a></li>
<li><a href="#org29f9124">Test de Turing</a></li>
<li><a href="#org596e4b8">Teoría de agente</a></li>
</ul>
</li>
<li><a href="#orgc6952ac">Clase 2</a>
<ul>
<li><a href="#org9679a1c">Antecedentes generales</a></li>
</ul>
</li>
<li><a href="#org6a59fb1">Clase 3</a>
<ul>
<li><a href="#org0b3983f">Inteligencia</a></li>
<li><a href="#org4fe56a1">Aplicaciones de la inteligencia artificial</a></li>
<li><a href="#org895a4bd">Agente Racional</a></li>
<li><a href="#orgc0b92e6">Modelo estándar de Inteligencia Artificial</a></li>
<li><a href="#org9799a36">Ética de la Inteligencia Artificial</a></li>
</ul>
</li>
<li><a href="#orgfd05edc">Clase 4</a>
<ul>
<li><a href="#org47e346b">Más aplicaciones de la Inteligencia Artificial</a></li>
</ul>
</li>
<li><a href="#orga5daa96">Clase 5</a>
<ul>
<li><a href="#org959ebef">Ética de la Inteligencia Artificial</a></li>
<li><a href="#org8d69cb0">Modelo estándar de la Inteligencia Artificial.</a></li>
</ul>
</li>
<li><a href="#org90ce086">Clase 6</a>
<ul>
<li><a href="#org9e37d20">Ejemplos de agentes</a></li>
<li><a href="#org50b327b">Repaso de los componentes de los agentes</a></li>
<li><a href="#org5972aac">Secuencia de percepcion</a></li>
<li><a href="#org14c0159">Función de agente</a></li>
<li><a href="#org976d72f">Medida de rendimiento</a></li>
<li><a href="#org1004bd8">Racionalidad</a></li>
<li><a href="#orgda1f6ef">Agente racional</a></li>
</ul>
</li>
<li><a href="#org30d6b69">Clase 7</a>
<ul>
<li><a href="#orga6f0eb6">Mundo de la Aspiradora</a></li>
<li><a href="#org9b88f81">Agente Racional</a></li>
<li><a href="#org25e30f6">Agente Omnisciente</a></li>
</ul>
</li>
<li><a href="#orge588329">Laboratorio 1</a>
<ul>
<li><a href="#org970eea7">Mundo de la aspiradora</a></li>
</ul>
</li>
<li><a href="#orgad6e322">Clase 8</a>
<ul>
<li><a href="#org4197ee8">Agente Racional</a></li>
<li><a href="#org4e4346c">Recolección de información</a></li>
<li><a href="#org5c4b3f2">Ambientes</a></li>
</ul>
</li>
<li><a href="#orga7f73ac">Clase 9</a>
<ul>
<li><a href="#org2204113">Tipos de Ambientes</a></li>
<li><a href="#org5474772">Ejemplo</a></li>
<li><a href="#org61a3b5e">Estructura de Agentes</a></li>
</ul>
</li>
<li><a href="#orgb6ba7cd">Clase 10</a>
<ul>
<li><a href="#org237c733">Agentes de Trabajo (PEAS)</a></li>
</ul>
</li>
<li><a href="#org7b84524">Clase 11</a>
<ul>
<li><a href="#org2a2802f">Tipos de Agentes</a></li>
<li><a href="#org5293170">Algoritmos de búsqueda</a></li>
</ul>
</li>
<li><a href="#orgaf94aca">Clase 12</a>
<ul>
<li><a href="#orgb2287ce">Ejemplo problema de búsqeda</a></li>
<li><a href="#orgba4197a">Camino</a></li>
<li><a href="#org123c19d">Algoritmos de búsqueda</a></li>
<li><a href="#orgaee9550">Árbol de búsqueda</a></li>
<li><a href="#orgfa26049">Estructuruda de nodos.</a></li>
<li><a href="#org828c749">Función de expansión de nodos en el árbol de búsqueda.</a></li>
</ul>
</li>
<li><a href="#orga6d921b">Clase 13</a>
<ul>
<li><a href="#org1a1eeb8">Algoritmos de búsqueda</a></li>
<li><a href="#org71dc9ac">Frontera</a></li>
<li><a href="#org7b41e3f">Tipos de pila</a></li>
<li><a href="#org3e5448b">Algoritmo Primero Mejor</a></li>
<li><a href="#orgd86f5c5">Algoritmo Primero en Amplitud</a></li>
</ul>
</li>
<li><a href="#org31ba351">Clase 14</a>
<ul>
<li><a href="#orgb06442d">Algoritmo A*</a></li>
</ul>
</li>
<li><a href="#org62e269a">Clase 15</a>
<ul>
<li><a href="#org9e034b0">Algoritmos de búsqueda</a></li>
<li><a href="#orge9ca4ec">Estrategias para encontrar un final</a></li>
<li><a href="#org30784f2">Algoritmo primero en amplitud</a></li>
<li><a href="#orge71a9b3">Algoritmos de búsqueda desinformada</a></li>
</ul>
</li>
<li><a href="#org340b1d0">Clase 16</a>
<ul>
<li><a href="#orge58d09f">Algoritmos de búsqueda desinformaada</a></li>
</ul>
</li>
<li><a href="#org6e9b346">Clase 17</a>
<ul>
<li><a href="#org3a78b7d">Búsqueda heurística (informada)</a></li>
</ul>
</li>
<li><a href="#org1eef5a0">Clase 18</a>
<ul>
<li><a href="#org2f4610d">Agentes que resuelven problemas</a></li>
</ul>
</li>
<li><a href="#org3f2f219">Clase 19</a>
<ul>
<li><a href="#org8441c9a">Búsqueda Heurística</a></li>
<li><a href="#org345d89d">Hint tarea</a></li>
<li><a href="#org4d2a746">Hint práctica</a></li>
</ul>
</li>
<li><a href="#orgb0e8802">Clase 20</a>
<ul>
<li><a href="#orgf830af7">Factor de ramificación efectivo</a></li>
<li><a href="#orgc39f622">Profundidad efectiva</a></li>
<li><a href="#orgd0145d8">Heurística compuesta</a></li>
</ul>
</li>
<li><a href="#org06a64ee">Clase 21</a>
<ul>
<li><a href="#org960546b">Búsqueda heurística</a></li>
</ul>
</li>
<li><a href="#orgf8c7c1a">Clase 22</a>
<ul>
<li><a href="#orgb2b2ec4">A* pesado</a></li>
<li><a href="#orgc19a47b">Búsqueda bidireccional</a></li>
</ul>
</li>
<li><a href="#org9b4130c">Clase 23</a>
<ul>
<li><a href="#org65d5f6b">Búsqueda bidireccional</a></li>
<li><a href="#orgb548a01">Beam Search (búsqueda por haz)</a></li>
</ul>
</li>
<li><a href="#orgfc9acff">Clase 24</a>
<ul>
<li><a href="#orgdb71f2f">Búsquedas en problemas parcialmente observables</a></li>
</ul>
</li>
<li><a href="#org36ed9ab">Clase 25</a>
<ul>
<li><a href="#org7db66dc">Búsqueda por optimización</a></li>
<li><a href="#org2d75dea">Ascenso de la colina</a></li>
<li><a href="#orgc6992a3">Algoritmo genético</a></li>
</ul>
</li>
<li><a href="#org1b8f5b1">Clase 26</a>
<ul>
<li><a href="#orgef4f639">Algoritmo genético</a></li>
<li><a href="#org0d98007">ONE MAX</a></li>
</ul>
</li>
<li><a href="#orgc3e7f2b">Clase 27</a>
<ul>
<li><a href="#orgfe57888">Agentes probabilísticos</a></li>
<li><a href="#org3b4f59e">Teoría de utilidad</a></li>
<li><a href="#orgf00a726">Teoría de decisión</a></li>
<li><a href="#org548809f">Probabilidad</a></li>
<li><a href="#org83ddcf4">Teoría de decisión</a></li>
</ul>
</li>
<li><a href="#orgfe5d39c">Clase 28</a>
<ul>
<li><a href="#org65a99fc">Redes Bayesianas</a></li>
<li><a href="#orge885a32">Muestreo por rechazo</a></li>
</ul>
</li>
<li><a href="#orgea0e9d5">Clase 29</a>
<ul>
<li><a href="#orgd55275f">Inferencia Redes Bayesianas</a></li>
<li><a href="#orgfd2000b">Ley de los grandes números</a></li>
<li><a href="#orgc97ce25">Muestreo ponderado</a></li>
</ul>
</li>
<li><a href="#org2038cb5">Clase 30</a>
<ul>
<li><a href="#org4c5b3d7">Agentes de aprendizaje</a></li>
</ul>
</li>
<li><a href="#orgb6bacad">Clase 31</a>
<ul>
<li><a href="#org7fc9acf">Aprendizaje supervisado</a></li>
</ul>
</li>
<li><a href="#org23c8e87">Clase 32</a>
<ul>
<li><a href="#org9d32b3d">Evaluación de clasificación</a></li>
<li><a href="#org348f359">Clasificadores lineales</a></li>
</ul>
</li>
<li><a href="#org0f899c7">Clase 33</a>
<ul>
<li><a href="#org150469c">Clasificacion</a></li>
<li><a href="#org8b506a5">Perceptrón</a></li>
<li><a href="#orgcf25bee">Aprendizaje no supervisado</a></li>
<li><a href="#orgf0cac16">Agrupamiento por k-medias</a></li>
<li><a href="#orgc7c28ba">Evaluación</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb9b00a8">Tareas</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6be8838" class="outline-2">
<h2 id="org6be8838">Bibliografía</h2>
<div class="outline-text-2" id="text-org6be8838">
<ul class="org-ul">
<li>Russell y Morvig. Artificial Intelligence 4ta ed.</li>

<li>Joshi. Artificial Intelligence with python.</li>
</ul>
</div>
</div>

<div id="outline-container-org277f7a3" class="outline-2">
<h2 id="org277f7a3">Evaluación</h2>
<div class="outline-text-2" id="text-org277f7a3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Rubro</th>
<th scope="col" class="org-right">Porcentaje</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">3 Exámenes</td>
<td class="org-right">50</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3 Tareas y</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3 Prácticas</td>
<td class="org-right">50</td>
</tr>
</tbody>
</table>

<p>
Hay una reposición. Se tomará la calificación más alta.
</p>

<p>
Cada día de entrega tardía será penalizado con 1 pt.
</p>
</div>
</div>

<div id="outline-container-org48a4a82" class="outline-2">
<h2 id="org48a4a82">Notas de Clase</h2>
<div class="outline-text-2" id="text-org48a4a82">
</div>
<div id="outline-container-org77a080c" class="outline-3">
<h3 id="org77a080c">Clase 1</h3>
<div class="outline-text-3" id="text-org77a080c">
</div>
<div id="outline-container-org05f75fe" class="outline-4">
<h4 id="org05f75fe">Temario</h4>
<div class="outline-text-4" id="text-org05f75fe">
<ol class="org-ol">
<li><p>
Introducción
</p>

<p>
1.1 Definición de IA
</p>

<p>
1.2 Marco histórico
</p>

<p>
1.3 Aplicaciones
</p>

<p>
1.4 Consideraciones éticas
</p></li>

<li><p>
Agentes racionales
</p>

<p>
2.1 Definición
</p>

<p>
2.2 Entorno / Ambiente
</p>

<p>
2.3 Estructura de Agentes
</p></li>

<li><p>
Búsqueda
</p>

<p>
3.1 Búsqueda desinformada y heurística
</p>

<p>
3.2 Búsqueda por optimización
</p>

<p>
3.3 Algoritmos genéticos
</p></li>

<li><p>
Modelos probabilísticos
</p>

<p>
4.1 Modelos gráficos
</p>

<p>
4.2 Redes Bayesianas: Bayes naive, HMM
</p>

<p>
4.3 Procesos de decisión markoviana
</p></li>

<li><p>
Aprendizaje automático
</p>

<p>
5.1 Teoría del aprendizaje
</p>

<p>
5.2 Aprendizaje supervisado, no supervisado, por refuerzo
</p>

<p>
5.3 Modelos paramétricos y no-paramétricos
</p>

<p>
5.4 Aprendizaje profundo
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org60a252b" class="outline-4">
<h4 id="org60a252b">Inteligencia Artificial</h4>
<div class="outline-text-4" id="text-org60a252b">
<p>
La inteligencia es un atributo humano que consiste de un proceso
para resolver problemas de manera racional.
</p>

<p>
La IA estudia y dearrolla entidades (artificiales) inteligentes.
</p>

<p>
Existen diferentes perspectivas de la inteligencia. Humano y
Racional.
</p>

<p>
Racional \(\subset\) Humano
</p>

<p>
De manera interna podemos identificar un rubro interno, que
corresponde al pensamiento, mientras que el externo el
comportamiento.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Humano</th>
<th scope="col" class="org-left">Racional</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Int. Pensamiento</td>
<td class="org-left">Ciencias</td>
<td class="org-left">Lógica</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">cognitivas</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Ext. Comportamiento</td>
<td class="org-left">Test de Turing</td>
<td class="org-left">Teoría de</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">agente</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org29f9124" class="outline-4">
<h4 id="org29f9124">Test de Turing</h4>
<div class="outline-text-4" id="text-org29f9124">
<p>
Es una prueba en donde participan dos entidades, un humano y una
computadora. Estos se comunican con un juez, y éste juez debe
determinar quién de estas dos entidades es un humano.
</p>
</div>
</div>

<div id="outline-container-org596e4b8" class="outline-4">
<h4 id="org596e4b8">Teoría de agente</h4>
<div class="outline-text-4" id="text-org596e4b8">
<ul class="org-ul">
<li><p>
Agente: Es una entidad que puede actuar de manera autónoma.
</p>

<p>
Éste agente comienza en un estado inicial y puede cambiar de
estado hasta llegar a un estado final por medio de las acciones
permitidas en un ambiente.
</p></li>
</ul>
</div>
</div>
</div>
