content/notas/IA/Notas.org
*** Antecedentes generales

    La inteligencia artificial nace como una herramienta para resolver
    teoremas y problemas lógicos.

    Uno de los primeros usos de la inteligencia artificial fue el
    procesamiento natural del lenguaje, y en particular para la
    traducción de frases de un idioma a otro.

    Los avances de la inteligencia artificial, se han hecho con base a
    hechos biológicos, como las redes neuronales y teorías evolutivas.

    Posteriormente surgieron las redes lógicas con las ideas de Alan
    Turing para calcular los pesesos entre neuronas. Con ello nacen lo
    que hoy conocemos como redes neuronales.

    Se desarrollaron múltiples redes con distintas bases científicas.

    Posterior al desarrollo de las redes neuronales se realizan
    avances en sistemas expertos.

    Los científicos hallaron muchos fracasos en la cuestión de
    inteligencia artificial, por lo que no se realizaron más
    investigación y por tanto menos avances relacionadas a
    inteligencia artificial.

    La combinación con otras ciencias como la probabilidad,
    estadística y procesos estocásticos, es lo que ha hecho a la
    inteligencia artificial lo que es ahora.

    En años recientes ya hay varias aplicaciones de la inteligencia
    artificial, especialmente a las ciencias de datos, por lo que se
    ha vuelto un campo importante dentro de las ciencias de la
    computación.

** Clase 3

*** Inteligencia
    
    |                | Humano         | Racional   |
    |----------------+----------------+------------|
    | Penamiento     | Ciencias       | Lógica     |
    |                | cognitivas     |            |
    |----------------+----------------+------------|
    | Comportamiento | Test de Turing | Teoría de  |
    |                |                | agentes    |
    |                |                | *racionales* |

    
**** Liebniz ~ Cálculo Ratiocinator

     Fue pensada como una máquina que utilizara la razón para dar
     resultados lógicos.

     Fue una de las primeras intensiones para crear la inteligencia
     artificial.

**** Inteligencia Artificial Fuerte

     Una IA es fuerte si es capaz de resolver cualquier problema
     "inteligente". Se podría decir también que es fuerte si es capaz
     de actuar como humano.

**** Inteligencia Artificial Débil

     Una IA es débil cuando se enfoca únicamente a resolver un
     problema específico.

***** Problemas

      1. Como input se recibe la cuenta de un restaurante en
         $\mathbb{R}$; regresa la propina del $20\%$

	 ¿La solución requiere de una inteligencia artificial?

	 No, pues existe un algoritmo para calcular esta propina.
	 
      2. Detectar spam en un correo

	 ¿La solución requiere de una inteligencia artificial?

	 Es posible, pues los algoritmos que podrían haber (sin
         utilizar inteligencia artificial) para resolverlo no serían
         capaces de adaptarse a todos los posibles correos ni a todas
         las personas.

*** Aplicaciones de la inteligencia artificial

    1. Demostración automática

    2. Procesamiento de imágenes

       2.1 Clasificar

       2.2 Reconocimiento de objetos

       2.3 Generación de imágenes

       - Dall-e

       - Stable diffussion

       2.4 Videos

    3. Procesamiento del Lenguaje Natural

       3.1 Traducción automática

       3.2 Generación del lenguaje natural

       - ChatGPT

       3.3 Voz

    4. Robótica

       4.1 Vehículos autónomos

    5. Juegos

       5.1 Deep Blue

       5.2 AlphaGo

       5.3 AlphaZero

*** Agente Racional

    Es una agente que actúa para solucionar problemas de manera
    eficiente. Busca una solución óptima.

*** Modelo estándar de Inteligencia Artificial

    Es el modelo que se enfoca en el estudio y desarrollo de Agentes
    Racionales.

**** Ventajas
     
     1. Nos permite solucionar problemas de manera óptima.
     2. Contiene a la parte lógica.
     3. Permite modelos matemáticos.

*** Ética de la Inteligencia Artificial

**** Usos desventajosos de la Inteligencia Artificial

     1. Violación de la privacidad.
     2. Uso de armas letales.
     3. Robo de datos.
     4. Aplicaciones con sesgos o datos sesgados.

**** Problema de la Alineación de valores

     Que los valores / objetivos de una Inteligencia Artificial deben
     estar alineados con los valores humanos.

** Clase 4

*** Más aplicaciones de la Inteligencia Artificial

**** Visión computacional

     Es un campo de la inteligencia artificial que permite a los
     sistemas obtener información de imágenes y representaciones
     visuales.

     Utiliza modelos para emular la visión que tienen los humanos para
     la comprensión de éstas imágenes.

     En la modernidad, ya una Inteligencia Artificial es capaz de
     reconocer imágenes mejor que el humano en ciertos aspectos.

     Tiene dos componentes principales; un componente de Aprendizaje
     Automatizado, y un modelo de red neuronal.

     Los componentes de Aprendizaje Automatizado (/Machine Learning/),
     en donde una máquina tiene la capacidad de aprender por medio de
     dos conjuntos, el conjunto de entrenamiento y el conjunto de
     prueba. De esta manera una máquina se enseña a reconocer éstas
     imágenes.

     Por otra parte, el modelo de red neuronal convolucional recibe
     cada píxel, lo procesa y posteriormente los convoluciona.

     Existen varias aplicaciones de la *Visión Computacional*

     - Clasificación de imágenes
     - Detección de objetos
     - Seguimiento
     - Recuperación de imágenes basada en contenido.
     
