notas/IA/Notas.html


<div id="outline-container-orgc6952ac" class="outline-3">
<h3 id="orgc6952ac">Clase 2</h3>
<div class="outline-text-3" id="text-orgc6952ac">
</div>
<div id="outline-container-org9679a1c" class="outline-4">
<h4 id="org9679a1c">Antecedentes generales</h4>
<div class="outline-text-4" id="text-org9679a1c">
<p>
La inteligencia artificial nace como una herramienta para resolver
teoremas y problemas lógicos.
</p>

<p>
Uno de los primeros usos de la inteligencia artificial fue el
procesamiento natural del lenguaje, y en particular para la
traducción de frases de un idioma a otro.
</p>

<p>
Los avances de la inteligencia artificial, se han hecho con base a
hechos biológicos, como las redes neuronales y teorías evolutivas.
</p>

<p>
Posteriormente surgieron las redes lógicas con las ideas de Alan
Turing para calcular los pesesos entre neuronas. Con ello nacen lo
que hoy conocemos como redes neuronales.
</p>

<p>
Se desarrollaron múltiples redes con distintas bases científicas.
</p>

<p>
Posterior al desarrollo de las redes neuronales se realizan
avances en sistemas expertos.
</p>

<p>
Los científicos hallaron muchos fracasos en la cuestión de
inteligencia artificial, por lo que no se realizaron más
investigación y por tanto menos avances relacionadas a
inteligencia artificial.
</p>

<p>
La combinación con otras ciencias como la probabilidad,
estadística y procesos estocásticos, es lo que ha hecho a la
inteligencia artificial lo que es ahora.
</p>

<p>
En años recientes ya hay varias aplicaciones de la inteligencia
artificial, especialmente a las ciencias de datos, por lo que se
ha vuelto un campo importante dentro de las ciencias de la
computación.
</p>
</div>
</div>
</div>

<div id="outline-container-org6a59fb1" class="outline-3">
<h3 id="org6a59fb1">Clase 3</h3>
<div class="outline-text-3" id="text-org6a59fb1">
</div>
<div id="outline-container-org0b3983f" class="outline-4">
<h4 id="org0b3983f">Inteligencia</h4>
<div class="outline-text-4" id="text-org0b3983f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Humano</th>
<th scope="col" class="org-left">Racional</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Penamiento</td>
<td class="org-left">Ciencias</td>
<td class="org-left">Lógica</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">cognitivas</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Comportamiento</td>
<td class="org-left">Test de Turing</td>
<td class="org-left">Teoría de</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">agentes</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><b>racionales</b></td>
</tr>
</tbody>
</table>
</div>


<ul class="org-ul">
<li><a id="orgbba48d0"></a>Liebniz ~ Cálculo Ratiocinator<br />
<div class="outline-text-5" id="text-orgbba48d0">
<p>
Fue pensada como una máquina que utilizara la razón para dar
resultados lógicos.
</p>

<p>
Fue una de las primeras intensiones para crear la inteligencia
artificial.
</p>
</div>
</li>

<li><a id="org7f87b6e"></a>Inteligencia Artificial Fuerte<br />
<div class="outline-text-5" id="text-org7f87b6e">
<p>
Una IA es fuerte si es capaz de resolver cualquier problema
"inteligente". Se podría decir también que es fuerte si es capaz
de actuar como humano.
</p>
</div>
</li>

<li><a id="org88adda5"></a>Inteligencia Artificial Débil<br />
<div class="outline-text-5" id="text-org88adda5">
<p>
Una IA es débil cuando se enfoca únicamente a resolver un
problema específico.
</p>
</div>

<ul class="org-ul">
<li><a id="orgf4eb465"></a>Problemas<br />
<div class="outline-text-6" id="text-orgf4eb465">
<ol class="org-ol">
<li><p>
Como input se recibe la cuenta de un restaurante en
\(\mathbb{R}\); regresa la propina del \(20\%\)
</p>

<p>
¿La solución requiere de una inteligencia artificial?
</p>

<p>
No, pues existe un algoritmo para calcular esta propina.
</p></li>

<li><p>
Detectar spam en un correo
</p>

<p>
¿La solución requiere de una inteligencia artificial?
</p>

<p>
Es posible, pues los algoritmos que podrían haber (sin
utilizar inteligencia artificial) para resolverlo no serían
capaces de adaptarse a todos los posibles correos ni a todas
las personas.
</p></li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org4fe56a1" class="outline-4">
<h4 id="org4fe56a1">Aplicaciones de la inteligencia artificial</h4>
<div class="outline-text-4" id="text-org4fe56a1">
<ol class="org-ol">
<li>Demostración automática</li>

<li><p>
Procesamiento de imágenes
</p>

<p>
2.1 Clasificar
</p>

<p>
2.2 Reconocimiento de objetos
</p>

<p>
2.3 Generación de imágenes
</p>

<ul class="org-ul">
<li>Dall-e</li>

<li>Stable diffussion</li>
</ul>

<p>
2.4 Videos
</p></li>

<li><p>
Procesamiento del Lenguaje Natural
</p>

<p>
3.1 Traducción automática
</p>

<p>
3.2 Generación del lenguaje natural
</p>

<ul class="org-ul">
<li>ChatGPT</li>
</ul>

<p>
3.3 Voz
</p></li>

<li><p>
Robótica
</p>

<p>
4.1 Vehículos autónomos
</p></li>

<li><p>
Juegos
</p>

<p>
5.1 Deep Blue
</p>

<p>
5.2 AlphaGo
</p>

<p>
5.3 AlphaZero
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org895a4bd" class="outline-4">
<h4 id="org895a4bd">Agente Racional</h4>
<div class="outline-text-4" id="text-org895a4bd">
<p>
Es una agente que actúa para solucionar problemas de manera
eficiente. Busca una solución óptima.
</p>
</div>
</div>

<div id="outline-container-orgc0b92e6" class="outline-4">
<h4 id="orgc0b92e6">Modelo estándar de Inteligencia Artificial</h4>
<div class="outline-text-4" id="text-orgc0b92e6">
<p>
Es el modelo que se enfoca en el estudio y desarrollo de Agentes
Racionales.
</p>
</div>

<ul class="org-ul">
<li><a id="org8e5ee76"></a>Ventajas<br />
<div class="outline-text-5" id="text-org8e5ee76">
<ol class="org-ol">
<li>Nos permite solucionar problemas de manera óptima.</li>
<li>Contiene a la parte lógica.</li>
<li>Permite modelos matemáticos.</li>
</ol>
</div>
</li>
</ul>
</div>

<div id="outline-container-org9799a36" class="outline-4">
<h4 id="org9799a36">Ética de la Inteligencia Artificial</h4>
<div class="outline-text-4" id="text-org9799a36">
</div>
<ul class="org-ul">
<li><a id="org55b60eb"></a>Usos desventajosos de la Inteligencia Artificial<br />
<div class="outline-text-5" id="text-org55b60eb">
<ol class="org-ol">
<li>Violación de la privacidad.</li>
<li>Uso de armas letales.</li>
<li>Robo de datos.</li>
<li>Aplicaciones con sesgos o datos sesgados.</li>
</ol>
</div>
</li>

<li><a id="org388de41"></a>Problema de la Alineación de valores<br />
<div class="outline-text-5" id="text-org388de41">
<p>
Que los valores / objetivos de una Inteligencia Artificial deben
estar alineados con los valores humanos.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd05edc" class="outline-3">
<h3 id="orgfd05edc">Clase 4</h3>
<div class="outline-text-3" id="text-orgfd05edc">
</div>
<div id="outline-container-org47e346b" class="outline-4">
<h4 id="org47e346b">Más aplicaciones de la Inteligencia Artificial</h4>
<div class="outline-text-4" id="text-org47e346b">
</div>
<ul class="org-ul">
<li><a id="orgce779f4"></a>Visión computacional<br />
<div class="outline-text-5" id="text-orgce779f4">
<p>
Es un campo de la inteligencia artificial que permite a los
sistemas obtener información de imágenes y representaciones
visuales.
</p>

<p>
Utiliza modelos para emular la visión que tienen los humanos para
la comprensión de éstas imágenes.
</p>

<p>
En la modernidad, ya una Inteligencia Artificial es capaz de
reconocer imágenes mejor que el humano en ciertos aspectos.
</p>

<p>
Tiene dos componentes principales; un componente de Aprendizaje
Automatizado, y un modelo de red neuronal.
</p>

<p>
Los componentes de Aprendizaje Automatizado (<i>Machine Learning</i>),
en donde una máquina tiene la capacidad de aprender por medio de
dos conjuntos, el conjunto de entrenamiento y el conjunto de
prueba. De esta manera una máquina se enseña a reconocer éstas
imágenes.
</p>

<p>
Por otra parte, el modelo de red neuronal convolucional recibe
cada píxel, lo procesa y posteriormente los convoluciona.
</p>

<p>
Existen varias aplicaciones de la <b>Visión Computacional</b>
</p>

<ul class="org-ul">
<li>Clasificación de imágenes</li>
<li>Detección de objetos</li>
<li>Seguimiento</li>
<li>Recuperación de imágenes basada en contenido.</li>
</ul>
</div>
</li>
