content/notas/IA/Notas.org
**** Procesamiento de lenguaje natural

     Es un campo de la Inteligencia artificial que investiga la manera
     de comunicar a las máquinas con las personas mediante el uso de
     lenguajes naturales.

     En este campo de la investigación se encargan de preparar el
     model lingüístico para que los ingenieros informáticos lo
     implementen de manera eficiente y funcional.

     Lo lingüistas clasifican reglas de reconocimiento de patrones
     estructurales, empleando un formalismo gramatical concreto.

     Estos modelos pretenden reflejar la lógica del lenguaje y surgen
     a partir de las teorías de Noam Chomsky en los años 50.

     También existen campos de investigación con el uso de modelos
     probabilísticos, en donde los lingüistas recogen colecciones de
     ejemplos y datos con los que se calculan frecuencias de
     diferentes unidades ingüísticas y la probabilidad de aparecer en
     un contexto determinado. De esta manera se puede predecir cuál
     será la siguiente unidad en un contexto dado, sin necesidad de
     recurrir a reglas gramaticales explícitas.

** Clase 5

*** Ética de la Inteligencia Artificial

**** Problema de la alineación de valores.

     Los objetivos de unas IA deben estar alineados a los valores de
     los seres humanos

     Algunos puntos que hay que considerar son:

     1. Transparencia ~ Documentación
     2. Predecibilidad ~ Anticipar comportamientos
     3. No Manipulable
     4. Responsabilidad

**** Diseño ético

     1. Orientada a las personas que lo van a usar.
     2. Proveer la información suficiente para que los usuarios puedan
        tomar decisiones informadas.
     3. Respetar la decisión de las personas de cómo usar la
        aplicación.
     4. Balance entre seguridad y privacidad.
     5. Aplicaciones sustentables.
     6. Buscar sesgos de manera activa.
     7. Inclusivas.

*** Modelo estándar de la Inteligencia Artificial.

    Es el estudio y la generación de agentes racionales.

**** Agente Racional

     Es una entidad que actúa de manera autónoma, buscando la mejor
     solución a un problema.

***** Agentes

      Un agente tiene un *objetivo* para resolver un problema; éste se
      encuentra dentro de un ambiente, y los estímulos de éste
      ambiente hacia el agente lo conocemos como *percepciones*, y por
      tanto el agente tenga una función de *receptor* para transformar
      las percepciones transformándolas en información útil para el
      agente, y así tomar una decición para realizar una *acción*.

      + Entonces, un agente es una entidad que actúa de manera
        autónoma a partir de actuadores, cuya acción depende de las
        percepciones del ambiente recibidas por sus sensores.

      + Un ambiente dota de percepciones a un agente.

      + Un agente tiene sensores que reciben las percepciones del
        ambiente. Estos sensores permiten al agente saber cómo está el
        ambiente.

      + El agente procesa la información recibida por los sensores y
        elige una acción y así mismo realizar ésta por medio de sus
        actuadores, las cuales los manifiesta en el ambiente.

***** Mundo de la aspiradora

      |-----+-----|
      | A,1 | B,1 |
      |-----+-----|
      
      - Actuadores: La aspiradora y elementos motrices.
      - Sensores: Detector de suciedad y su posición en el ambiente.
      - Ambiente: Un espacio formado de dos cuadros. (Un arreglo
        unidimensional). Será 0 si está limpio, 1 en otro caso.
      - Acciones: Izquierda, derecha, limpiar


      |-----+-----|
      | A,1 | B,1 |
      |-----+-----|
      | C,1 | D,0 |
      |-----+-----|

      En un ambiente como este, las acciones cambian

      - Acciones: Izquierda, Derecha, Arriba, Abajo, Limpiar.
      
** Clase 6

*** Ejemplos de agentes

    - Humanos; pues cumplen la definición y por medio de los sentidos
      percibimos el ambiente, por otra parte tenemos nuestras
      habilidades motrices como las manos para actuar dentro de
      nuestro ambiente.
    - Robots; que de la misma manera perciben y reaccionan por medio
      de sus elementos motrices.
    - Software; aunque no es una entidad física de igual manera puede
      percibir la entrada del usuario, los archivos en memoria, entre
      otras cosas; mientras que sus actuadores serían las acciones que
      puede tomar el software dentro de la computadora.
    - entre otros...

*** Repaso de los componentes de los agentes

    Estos se componen de 4 cosas fundamentales:

    - El ambiente en donde se encuentra el agente
    - Los sensores
    - Actuadores
    - Percepción

*** Secuencia de percepcion

    Es un registo en el que se guarda todo lo que un agente ha
    recibido hasta cierto momento.

*** Función de agente

    La función de agente tiene como dominio un conjunto de secuencias
    de percepciones, y ésta nos devuelve una acción (o secuencia de
    acciones).

*** Medida de rendimiento

    Es una medida que evalúa el éxito del comportamiento del agente al
    resolver un problema.

*** Racionalidad

    Es la medida con la que se evalúa que un agente haga lo que se
    supone que debe hacer según el criterio del agente.

*** Agente racional

    Es una agente que utiliza el estado del ambiente para tomar las
    acciones precisas para realizar una tarea.

** Clase 7   

*** Mundo de la Aspiradora

**** Creación del ambiente

     El ambiente del mundo de la aspiradora consta de un conjunto de
     cuadros estructurados en diferentes posiciones. Consideramos un
     mundo que consta de 4 cuadros acomodados en una cuadrícula, en
     donde a la derecha de A se encuentra B y abajo de A se encuentra
     C, y así sucesivamente.

     Éste ambiente lo acomodamos en una matriz, con un estado en donde
     0 quiere decir que no hay suciedad y 1 que sí hay suciedad.

**** Creación del agente

     El agente debe saber dónde se encuentra y si el lugar donde se
     encuentra está sucio.

     También le agregamos su conjunto de acciones, en donde sabemos
     que sus acciones posibles son limpiar, ir arriba, ir abajo, ir a
     la izquierda e ir a la derecha.

**** Comportamiento del agente

