notas/IA/Notas.html

<li><a id="org27f83e7"></a>Procesamiento de lenguaje natural<br />
<div class="outline-text-5" id="text-org27f83e7">
<p>
Es un campo de la Inteligencia artificial que investiga la manera
de comunicar a las máquinas con las personas mediante el uso de
lenguajes naturales.
</p>

<p>
En este campo de la investigación se encargan de preparar el
model lingüístico para que los ingenieros informáticos lo
implementen de manera eficiente y funcional.
</p>

<p>
Lo lingüistas clasifican reglas de reconocimiento de patrones
estructurales, empleando un formalismo gramatical concreto.
</p>

<p>
Estos modelos pretenden reflejar la lógica del lenguaje y surgen
a partir de las teorías de Noam Chomsky en los años 50.
</p>

<p>
También existen campos de investigación con el uso de modelos
probabilísticos, en donde los lingüistas recogen colecciones de
ejemplos y datos con los que se calculan frecuencias de
diferentes unidades ingüísticas y la probabilidad de aparecer en
un contexto determinado. De esta manera se puede predecir cuál
será la siguiente unidad en un contexto dado, sin necesidad de
recurrir a reglas gramaticales explícitas.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga5daa96" class="outline-3">
<h3 id="orga5daa96">Clase 5</h3>
<div class="outline-text-3" id="text-orga5daa96">
</div>
<div id="outline-container-org959ebef" class="outline-4">
<h4 id="org959ebef">Ética de la Inteligencia Artificial</h4>
<div class="outline-text-4" id="text-org959ebef">
</div>
<ul class="org-ul">
<li><a id="org78a12b7"></a>Problema de la alineación de valores.<br />
<div class="outline-text-5" id="text-org78a12b7">
<p>
Los objetivos de unas IA deben estar alineados a los valores de
los seres humanos
</p>

<p>
Algunos puntos que hay que considerar son:
</p>

<ol class="org-ol">
<li>Transparencia ~ Documentación</li>
<li>Predecibilidad ~ Anticipar comportamientos</li>
<li>No Manipulable</li>
<li>Responsabilidad</li>
</ol>
</div>
</li>

<li><a id="orgf66bfac"></a>Diseño ético<br />
<div class="outline-text-5" id="text-orgf66bfac">
<ol class="org-ol">
<li>Orientada a las personas que lo van a usar.</li>
<li>Proveer la información suficiente para que los usuarios puedan
tomar decisiones informadas.</li>
<li>Respetar la decisión de las personas de cómo usar la
aplicación.</li>
<li>Balance entre seguridad y privacidad.</li>
<li>Aplicaciones sustentables.</li>
<li>Buscar sesgos de manera activa.</li>
<li>Inclusivas.</li>
</ol>
</div>
</li>
</ul>
</div>

<div id="outline-container-org8d69cb0" class="outline-4">
<h4 id="org8d69cb0">Modelo estándar de la Inteligencia Artificial.</h4>
<div class="outline-text-4" id="text-org8d69cb0">
<p>
Es el estudio y la generación de agentes racionales.
</p>
</div>

<ul class="org-ul">
<li><a id="org2293891"></a>Agente Racional<br />
<div class="outline-text-5" id="text-org2293891">
<p>
Es una entidad que actúa de manera autónoma, buscando la mejor
solución a un problema.
</p>
</div>

<ul class="org-ul">
<li><a id="org212869d"></a>Agentes<br />
<div class="outline-text-6" id="text-org212869d">
<p>
Un agente tiene un <b>objetivo</b> para resolver un problema; éste se
encuentra dentro de un ambiente, y los estímulos de éste
ambiente hacia el agente lo conocemos como <b>percepciones</b>, y por
tanto el agente tenga una función de <b>receptor</b> para transformar
las percepciones transformándolas en información útil para el
agente, y así tomar una decición para realizar una <b>acción</b>.
</p>

<ul class="org-ul">
<li>Entonces, un agente es una entidad que actúa de manera
autónoma a partir de actuadores, cuya acción depende de las
percepciones del ambiente recibidas por sus sensores.</li>

<li>Un ambiente dota de percepciones a un agente.</li>

<li>Un agente tiene sensores que reciben las percepciones del
ambiente. Estos sensores permiten al agente saber cómo está el
ambiente.</li>

<li>El agente procesa la información recibida por los sensores y
elige una acción y así mismo realizar ésta por medio de sus
actuadores, las cuales los manifiesta en el ambiente.</li>
</ul>
</div>
</li>

<li><a id="orgd259c46"></a>Mundo de la aspiradora<br />
<div class="outline-text-6" id="text-orgd259c46">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">A,1</td>
<td class="org-left">B,1</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Actuadores: La aspiradora y elementos motrices.</li>
<li>Sensores: Detector de suciedad y su posición en el ambiente.</li>
<li>Ambiente: Un espacio formado de dos cuadros. (Un arreglo
unidimensional). Será 0 si está limpio, 1 en otro caso.</li>
<li>Acciones: Izquierda, derecha, limpiar</li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">A,1</th>
<th scope="col" class="org-left">B,1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C,1</td>
<td class="org-left">D,0</td>
</tr>
</tbody>
</table>

<p>
En un ambiente como este, las acciones cambian
</p>

<ul class="org-ul">
<li>Acciones: Izquierda, Derecha, Arriba, Abajo, Limpiar.</li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org90ce086" class="outline-3">
<h3 id="org90ce086">Clase 6</h3>
<div class="outline-text-3" id="text-org90ce086">
</div>
<div id="outline-container-org9e37d20" class="outline-4">
<h4 id="org9e37d20">Ejemplos de agentes</h4>
<div class="outline-text-4" id="text-org9e37d20">
<ul class="org-ul">
<li>Humanos; pues cumplen la definición y por medio de los sentidos
percibimos el ambiente, por otra parte tenemos nuestras
habilidades motrices como las manos para actuar dentro de
nuestro ambiente.</li>
<li>Robots; que de la misma manera perciben y reaccionan por medio
de sus elementos motrices.</li>
<li>Software; aunque no es una entidad física de igual manera puede
percibir la entrada del usuario, los archivos en memoria, entre
otras cosas; mientras que sus actuadores serían las acciones que
puede tomar el software dentro de la computadora.</li>
<li>entre otros&#x2026;</li>
</ul>
</div>
</div>

<div id="outline-container-org50b327b" class="outline-4">
<h4 id="org50b327b">Repaso de los componentes de los agentes</h4>
<div class="outline-text-4" id="text-org50b327b">
<p>
Estos se componen de 4 cosas fundamentales:
</p>

<ul class="org-ul">
<li>El ambiente en donde se encuentra el agente</li>
<li>Los sensores</li>
<li>Actuadores</li>
<li>Percepción</li>
</ul>
</div>
</div>

<div id="outline-container-org5972aac" class="outline-4">
<h4 id="org5972aac">Secuencia de percepcion</h4>
<div class="outline-text-4" id="text-org5972aac">
<p>
Es un registo en el que se guarda todo lo que un agente ha
recibido hasta cierto momento.
</p>
</div>
</div>

<div id="outline-container-org14c0159" class="outline-4">
<h4 id="org14c0159">Función de agente</h4>
<div class="outline-text-4" id="text-org14c0159">
<p>
La función de agente tiene como dominio un conjunto de secuencias
de percepciones, y ésta nos devuelve una acción (o secuencia de
acciones).
</p>
</div>
</div>

<div id="outline-container-org976d72f" class="outline-4">
<h4 id="org976d72f">Medida de rendimiento</h4>
<div class="outline-text-4" id="text-org976d72f">
<p>
Es una medida que evalúa el éxito del comportamiento del agente al
resolver un problema.
</p>
</div>
</div>

<div id="outline-container-org1004bd8" class="outline-4">
<h4 id="org1004bd8">Racionalidad</h4>
<div class="outline-text-4" id="text-org1004bd8">
<p>
Es la medida con la que se evalúa que un agente haga lo que se
supone que debe hacer según el criterio del agente.
</p>
</div>
</div>

<div id="outline-container-orgda1f6ef" class="outline-4">
<h4 id="orgda1f6ef">Agente racional</h4>
<div class="outline-text-4" id="text-orgda1f6ef">
<p>
Es una agente que utiliza el estado del ambiente para tomar las
acciones precisas para realizar una tarea.
</p>
</div>
</div>
</div>

<div id="outline-container-org30d6b69" class="outline-3">
<h3 id="org30d6b69">Clase 7</h3>
<div class="outline-text-3" id="text-org30d6b69">
</div>
<div id="outline-container-orga6f0eb6" class="outline-4">
<h4 id="orga6f0eb6">Mundo de la Aspiradora</h4>
<div class="outline-text-4" id="text-orga6f0eb6">
</div>
<ul class="org-ul">
<li><a id="orgf5ba4dc"></a>Creación del ambiente<br />
<div class="outline-text-5" id="text-orgf5ba4dc">
<p>
El ambiente del mundo de la aspiradora consta de un conjunto de
cuadros estructurados en diferentes posiciones. Consideramos un
mundo que consta de 4 cuadros acomodados en una cuadrícula, en
donde a la derecha de A se encuentra B y abajo de A se encuentra
C, y así sucesivamente.
</p>

<p>
Éste ambiente lo acomodamos en una matriz, con un estado en donde
0 quiere decir que no hay suciedad y 1 que sí hay suciedad.
</p>
</div>
</li>

<li><a id="orgf2b1525"></a>Creación del agente<br />
<div class="outline-text-5" id="text-orgf2b1525">
<p>
El agente debe saber dónde se encuentra y si el lugar donde se
encuentra está sucio.
</p>

<p>
También le agregamos su conjunto de acciones, en donde sabemos
que sus acciones posibles son limpiar, ir arriba, ir abajo, ir a
la izquierda e ir a la derecha.
</p>
</div>
</li>
