content/notas/IA/Notas.org
***** Función del agente

      Es una función $f:P^*\rightarrow A$ que toma una secuencia de
      percepciones y ejecuta una acción.

      \[f(p_1,p_2,\ldots,p_t)=\alpha\]

***** Programa del agente

      Es la implementación de la función del agente.

      Por ejemplo:
      
      \[f((A,1))=Limpiar\]

      /Esto tiene sentido pues el lugar donde se encuentra está sucio/

      \[f((A,1),(A,0))=Derecha\]

      /Esto pues la aspiradora debe conocer otra localización que no
      haya explorado aún./

*** Agente Racional

    Es un agente que busca optimizar el rendimiento.

    Éste selecciona con base a la información previa que tiene y a la
    secuencia de percepciones las acciones que maximice el rendimiento
    esperado.

    \[\max(\mathbb{E}(R))\]

**** Consecuencialismo

     La idea de medir el rendimiento a partir de las consecuencias de
     las acciones.

     En este caso, las consecuencias las podemos ver como los cambios
     de estado del ambiente.

     *Principio*. Es preferible medir la utilidad de acuerdo a lo que se
     quiere para el _entorno_, más que a _cómo el agente debe_
     _comportarse_.

     * En el mundo de la aspiradora el rendimiento lo podemos medir
       con lo siguiente.

       1. ¿Cuántos cuadros están limpios?

       2. ¿Cuánto tiempo le toma el ejecutar las acciones?

       3. Combinar 1 y 2

**** Puntos en la racionalidad

     1. Medida de rendimiento.

     2. Información sobre el entorno.

     3. Acciones.

     4. Secuencia de percepciones.

*** Agente Omnisciente

    Es un agente que conoce el resultado de sus acciones y actúa de
    acuerdo a esto.

    El agente omnisciente maximiza el rendimiento real ~ *Perfección*.

** Laboratorio 1
*** Mundo de la aspiradora

    Describiremos la forma en la que podremos representar este mundo,
    para que un agente actúe en éste.
    
****  Definición de los cuartos

     Construiremos los cuartos o cuadrados en los que va a interactuar
     el agente aspiradora. El ambiente se conformará de un conjunto de
     cuartos dispuestos en ciertas posiciones.

     #+begin_src python
class Square(object):

    def __init__(self, name):
        """
        Crea un objeto square, que representa los cuadrados del ambiente.
        
        Argumentos
        ----------
        name : str
        Nombre del cuadrado ('A', 'B', etc.)
        """
        self.name = name
        self.dirt = 0
        
        # Hasta que no se coloque con cuadrados vecinos, los movimientos no llevan a ningún lado
        self.left = self
        self.right = self
        self.up = self
        self.down = self
        
    def __str__(self):
        return self.name
     #+end_src

**** Creación del ambiente

     El ambiente del mundo de la aspiradora consta de un conjunto de
     cuadros estructurados en diferentes posiciones; estos cuadros
     pueden estar al lado de otros, o bien abajo o arriba de estos.

     Consideraremos un mundo con cuatro cuadros en lo que se puede
     posicionar el agente. El agente puede moverse en 4 posiciones,
     izquierda, dercha, arriba y abajap. La configuración en los
     cuartos que exploramos está configurada de la siguiente forma:

     \[\begin{matrix}[A] & [B]\\ [C] & [D]\end{matrix}\]

     Los nombres de los cuartos son A, B, C y D. Los cuadros A y B
     están en la parte superior y C y D en la parte inferior. A y C
     están del lado izquierdo y B, D del lado derecho.

     Así mismo, uno o ambos cuadrados pueden estar sucios (lo que se
     indica con 1) o limpios (indicado con 0). El ambiente indicará de
     manera aleatoria que el cuadrado está o no sucio.

     #+begin_src python
import random

class VacuumWorld(object):

    def __init__(self, dirt_init='random'):
        """
        Objeto que crea el ambiente para el mundo de la
        aspiradora:
        Se conforma de:
        - Dos cuadrados: A y B (A la izquierda de B)
        - Indicación de la limpieza (0) o suciedad (1) de los cuadrados

        Argumentos
        ----------
        dirt_init : str
          Forma en que se inicializará la suciedad de los cuadrados.
        """
        self.squares=[]
        self.A,self.B,self.C,self.D = Square('A'), Square
     #+end_src
** Clase 8

*** Agente Racional

    Es un agente que dada una _secuencia de percepciones_ y la
    _información previa_, forma la acción que maximiza la _medida de
    rendimiento_.

*** Recolección de información

    Tomar información del entorno que complementa la información
    previa del agente.

**** Exploración

     Ejecuta acciones que le permitan recolectar información del
     entorno.

**** Agente autónomo

     Es un agente que es capaz de recolectar información (aprender)
     para compensar las carencias de la información previa.

     En otro caso, se trata de un agente que carece de autonomía.

*** Ambientes

**** Ambiente de trabajo

     Éste se compone de cuatro elementos (REAS/PEAS):

     1. Medida de rendimiento

     2. Entorno

     3. Actuadores

     4. Sensores

