notas/IA/Notas.html

<li><a id="org36fa022"></a>Comportamiento del agente<br />
<ul class="org-ul">
<li><a id="orga0f81b9"></a>Función del agente<br />
<div class="outline-text-6" id="text-orga0f81b9">
<p>
Es una función \(f:P^*\rightarrow A\) que toma una secuencia de
percepciones y ejecuta una acción.
</p>

<p>
\[f(p_1,p_2,\ldots,p_t)=\alpha\]
</p>
</div>
</li>

<li><a id="org4c6630b"></a>Programa del agente<br />
<div class="outline-text-6" id="text-org4c6630b">
<p>
Es la implementación de la función del agente.
</p>

<p>
Por ejemplo:
</p>

<p>
\[f((A,1))=Limpiar\]
</p>

<p>
<i>Esto tiene sentido pues el lugar donde se encuentra está sucio</i>
</p>

<p>
\[f((A,1),(A,0))=Derecha\]
</p>

<p>
<i>Esto pues la aspiradora debe conocer otra localización que no
haya explorado aún.</i>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org9b88f81" class="outline-4">
<h4 id="org9b88f81">Agente Racional</h4>
<div class="outline-text-4" id="text-org9b88f81">
<p>
Es un agente que busca optimizar el rendimiento.
</p>

<p>
Éste selecciona con base a la información previa que tiene y a la
secuencia de percepciones las acciones que maximice el rendimiento
esperado.
</p>

<p>
\[\max(\mathbb{E}(R))\]
</p>
</div>

<ul class="org-ul">
<li><a id="org29f08d9"></a>Consecuencialismo<br />
<div class="outline-text-5" id="text-org29f08d9">
<p>
La idea de medir el rendimiento a partir de las consecuencias de
las acciones.
</p>

<p>
En este caso, las consecuencias las podemos ver como los cambios
de estado del ambiente.
</p>

<p>
<b>Principio</b>. Es preferible medir la utilidad de acuerdo a lo que se
quiere para el <span class="underline">entorno</span>, más que a <span class="underline">cómo el agente debe</span>
<span class="underline">comportarse</span>.
</p>

<ul class="org-ul">
<li>En el mundo de la aspiradora el rendimiento lo podemos medir
con lo siguiente.

<ol class="org-ol">
<li>¿Cuántos cuadros están limpios?</li>

<li>¿Cuánto tiempo le toma el ejecutar las acciones?</li>

<li>Combinar 1 y 2</li>
</ol></li>
</ul>
</div>
</li>

<li><a id="org87488ab"></a>Puntos en la racionalidad<br />
<div class="outline-text-5" id="text-org87488ab">
<ol class="org-ol">
<li>Medida de rendimiento.</li>

<li>Información sobre el entorno.</li>

<li>Acciones.</li>

<li>Secuencia de percepciones.</li>
</ol>
</div>
</li>
</ul>
</div>

<div id="outline-container-org25e30f6" class="outline-4">
<h4 id="org25e30f6">Agente Omnisciente</h4>
<div class="outline-text-4" id="text-org25e30f6">
<p>
Es un agente que conoce el resultado de sus acciones y actúa de
acuerdo a esto.
</p>

<p>
El agente omnisciente maximiza el rendimiento real ~ <b>Perfección</b>.
</p>
</div>
</div>
</div>

<div id="outline-container-orge588329" class="outline-3">
<h3 id="orge588329">Laboratorio 1</h3>
<div class="outline-text-3" id="text-orge588329">
</div>
<div id="outline-container-org970eea7" class="outline-4">
<h4 id="org970eea7">Mundo de la aspiradora</h4>
<div class="outline-text-4" id="text-org970eea7">
<p>
Describiremos la forma en la que podremos representar este mundo,
para que un agente actúe en éste.
</p>
</div>

<ul class="org-ul">
<li><a id="org4602551"></a>Definición de los cuartos<br />
<div class="outline-text-5" id="text-org4602551">
<p>
Construiremos los cuartos o cuadrados en los que va a interactuar
el agente aspiradora. El ambiente se conformará de un conjunto de
cuartos dispuestos en ciertas posiciones.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Square</span>(<span style="font-weight: bold;">object</span>):

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, name):
        <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">        Crea un objeto square, que representa los cuadrados del ambiente.</span>

<span style="font-style: italic;">        Argumentos</span>
<span style="font-style: italic;">        ----------</span>
<span style="font-style: italic;">        name : str</span>
<span style="font-style: italic;">        Nombre del cuadrado ('A', 'B', etc.)</span>
<span style="font-style: italic;">        """</span>
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">name</span> = name
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">dirt</span> = 0

        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Hasta que no se coloque con cuadrados vecinos, los movimientos no llevan a ning&#250;n lado</span>
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">left</span> = <span style="font-weight: bold;">self</span>
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">right</span> = <span style="font-weight: bold;">self</span>
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">up</span> = <span style="font-weight: bold;">self</span>
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">down</span> = <span style="font-weight: bold;">self</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__str__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.name
</pre>
</div>
</div>
</li>

<li><a id="orga093384"></a>Creación del ambiente<br />
<div class="outline-text-5" id="text-orga093384">
<p>
El ambiente del mundo de la aspiradora consta de un conjunto de
cuadros estructurados en diferentes posiciones; estos cuadros
pueden estar al lado de otros, o bien abajo o arriba de estos.
</p>

<p>
Consideraremos un mundo con cuatro cuadros en lo que se puede
posicionar el agente. El agente puede moverse en 4 posiciones,
izquierda, dercha, arriba y abajap. La configuración en los
cuartos que exploramos está configurada de la siguiente forma:
</p>

<p>
\[\begin{matrix}[A] & [B]\\ [C] & [D]\end{matrix}\]
</p>

<p>
Los nombres de los cuartos son A, B, C y D. Los cuadros A y B
están en la parte superior y C y D en la parte inferior. A y C
están del lado izquierdo y B, D del lado derecho.
</p>

<p>
Así mismo, uno o ambos cuadrados pueden estar sucios (lo que se
indica con 1) o limpios (indicado con 0). El ambiente indicará de
manera aleatoria que el cuadrado está o no sucio.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> random

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">VacuumWorld</span>(<span style="font-weight: bold;">object</span>):

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, dirt_init=<span style="font-style: italic;">'random'</span>):
        <span style="font-style: italic;">"""</span>
<span style="font-style: italic;">        Objeto que crea el ambiente para el mundo de la</span>
<span style="font-style: italic;">        aspiradora:</span>
<span style="font-style: italic;">        Se conforma de:</span>
<span style="font-style: italic;">        - Dos cuadrados: A y B (A la izquierda de B)</span>
<span style="font-style: italic;">        - Indicaci&#243;n de la limpieza (0) o suciedad (1) de los cuadrados</span>

<span style="font-style: italic;">        Argumentos</span>
<span style="font-style: italic;">        ----------</span>
<span style="font-style: italic;">        dirt_init : str</span>
<span style="font-style: italic;">          Forma en que se inicializar&#225; la suciedad de los cuadrados.</span>
<span style="font-style: italic;">        """</span>
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">squares</span>=[]
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">A</span>,<span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">B</span>,<span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">C</span>,<span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">D</span> = Square(<span style="font-style: italic;">'A'</span>), Square
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgad6e322" class="outline-3">
<h3 id="orgad6e322">Clase 8</h3>
<div class="outline-text-3" id="text-orgad6e322">
</div>
<div id="outline-container-org4197ee8" class="outline-4">
<h4 id="org4197ee8">Agente Racional</h4>
<div class="outline-text-4" id="text-org4197ee8">
<p>
Es un agente que dada una <span class="underline">secuencia de percepciones</span> y la
<span class="underline">información previa</span>, forma la acción que maximiza la <span class="underline">medida de
rendimiento</span>.
</p>
</div>
</div>

<div id="outline-container-org4e4346c" class="outline-4">
<h4 id="org4e4346c">Recolección de información</h4>
<div class="outline-text-4" id="text-org4e4346c">
<p>
Tomar información del entorno que complementa la información
previa del agente.
</p>
</div>

<ul class="org-ul">
<li><a id="org75dc57f"></a>Exploración<br />
<div class="outline-text-5" id="text-org75dc57f">
<p>
Ejecuta acciones que le permitan recolectar información del
entorno.
</p>
</div>
</li>

<li><a id="org21fb119"></a>Agente autónomo<br />
<div class="outline-text-5" id="text-org21fb119">
<p>
Es un agente que es capaz de recolectar información (aprender)
para compensar las carencias de la información previa.
</p>

<p>
En otro caso, se trata de un agente que carece de autonomía.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org5c4b3f2" class="outline-4">
<h4 id="org5c4b3f2">Ambientes</h4>
<div class="outline-text-4" id="text-org5c4b3f2">
</div>
<ul class="org-ul">
<li><a id="orge14164d"></a>Ambiente de trabajo<br />
<div class="outline-text-5" id="text-orge14164d">
<p>
Éste se compone de cuatro elementos (REAS/PEAS):
</p>

<ol class="org-ol">
<li>Medida de rendimiento</li>

<li>Entorno</li>

<li>Actuadores</li>

<li>Sensores</li>
</ol>
</div>

<ul class="org-ul">
