content/notas/IA/Notas.org
***** Ejemplos

      |            | R            | E          | A             | S           |
      |------------+--------------+------------+---------------+-------------|
      | Mundo      | # Limpios    | Estructura | Aspiradora    | Cámara      |
      | de la      | T            | de cuadros | llantas       |             |
      | aspiradora |              |            |               |             |
      |------------+--------------+------------+---------------+-------------|
      | SPAM       | # Correos    | Bandeja de | Programa de   | Programa de |
      |            | clasificados | entrada    | clasificación | lectura     |

**** Tipos de ambientes

***** Observables

      1. Totalmente Observable:

	 En todo momento el agente tiene info del entorno completo.
	 
      2. Parcialmente Observable:

	 En el que no está disponible toda la información en cualquier
         momento.

      3. Totalmente efectivamente observable:

	 Es parcialmente observable, pero el agente tiene acceso a la
         información necesaria para actiar.

      4. No Observables

***** Número de Agentes

      1. Agente individual:

	 Sólo actúa el agente.

      2. Multiagente:

	 2.1. Competitivos: Maximizar el rendimiento de un agente
         implica minimizar el de otro.

	 2.2. Cooperativos: Maximizar el rendimiento de uno, también
         maximiza el de otro.

***** Determinismo

      1. Determinista:

	 En donde los estados del entorno está completamente
         determinados por el estado anterior y la acción del agente.

      2. Estocástico ~ No determinista.

      3. Estratégico:

	 Es un entorno determinista, pero puede ser afectado por las
         acciones de otro agente.

***** Secuencialidad

      1. Episódicos:

	 Están divididos en episodios, en donde un episodio no afecta
         a futuros episódicos.

      2. Secuenciales:

	 Las decisiones actuales afectan a los estados futuros.

***** Dinamicidad

      1. Estáticos:

	 En donde sólamente se modifican por acciones del agente.
	 
      2. Dinámicos:

	 Se modifican sin necesidad de que el agente participe.
** Clase 9
*** Tipos de Ambientes
    
**** Continuidad

     1. Entorno discreto:

	Cuya estructura es discreta.

     2. Entorno contínuo:

	Cuya estructura es continuo.

**** Información

     1. Conocidos:

	Son aquellos en donde el agente tiene toda la información de
        manera previa.

     2. Desconocidos:

	Donde se tiene información parcial o ninguna sobre el
        ambiente.

*** Ejemplo
    
    |         | Obs     | Núm  | Determ | Sec       | Din      | Cont     | Info     |
    |---------+---------+------+--------+-----------+----------+----------+----------|
    | Mundo   | Total/  | Ind  | Determ | Episódico | Estático | Discreto | Conocido |
    | Asp     | Parcial |      |        |           |          |          |          |
    |---------+---------+------+--------+-----------+----------+----------+----------|
    | Ajedrez | Total   | Comp | Estrat | Secuenc   | Estático | Discreto | Conocido |

*** Estructura de Agentes

**** Función del agente

     Mapea un secuencia de percepciones a acciones.

**** Programa del agente

     La implementación de la función del agente.

**** Arquitectura del agente

     Es la parte física del agente, que cuenta con los sensores y los
     actuadores.

     Agente $=$ Programa $+$ Arquitectura

     Entorno $\rightarrow$ Sensores $\rightarrow$ Percepciones $\rightarrow$ Programa $\rightarrow$ Acción $\rightarrow$ Actuadores $\rightarrow$ Entorno

**** Tipos de Agentes

     1. Agente dirigido mediante tabla.

	Toma una tabla que asocia las percepciones a acciones
        específicas y en base a las percepciones consulta a la tabla y
        elige una ación.

	| Percepciones | Acciones |
	|--------------+----------|
	| p1           | a1       |
	| p2           | a2       |
	| ...          | ...      |
	| p1 ... pt    | at       |

	#+begin_src prog
funcion TABLE_DRIVEN_AGENT(p, table)
	percepciones <- percepciones ++ {p}
	accion <- CONSULTA(percepciones, tabla)
	return accion
	#+end_src

	#+begin_src python
class TableDrivenAgent(VacuumWorld):

    def __init__(self, table, location=None):
        self.location
	#+end_src

	etc...

** Clase 10
