notas/IA/Notas.html
<li><a id="orgcd6e7a5"></a>Ejemplos<br />
<div class="outline-text-6" id="text-orgcd6e7a5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">R</th>
<th scope="col" class="org-left">E</th>
<th scope="col" class="org-left">A</th>
<th scope="col" class="org-left">S</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Mundo</td>
<td class="org-left"># Limpios</td>
<td class="org-left">Estructura</td>
<td class="org-left">Aspiradora</td>
<td class="org-left">Cámara</td>
</tr>

<tr>
<td class="org-left">de la</td>
<td class="org-left">T</td>
<td class="org-left">de cuadros</td>
<td class="org-left">llantas</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">aspiradora</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SPAM</td>
<td class="org-left"># Correos</td>
<td class="org-left">Bandeja de</td>
<td class="org-left">Programa de</td>
<td class="org-left">Programa de</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">clasificados</td>
<td class="org-left">entrada</td>
<td class="org-left">clasificación</td>
<td class="org-left">lectura</td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</li>

<li><a id="org5728444"></a>Tipos de ambientes<br />
<ul class="org-ul">
<li><a id="org45d8aca"></a>Observables<br />
<div class="outline-text-6" id="text-org45d8aca">
<ol class="org-ol">
<li><p>
Totalmente Observable:
</p>

<p>
En todo momento el agente tiene info del entorno completo.
</p></li>

<li><p>
Parcialmente Observable:
</p>

<p>
En el que no está disponible toda la información en cualquier
momento.
</p></li>

<li><p>
Totalmente efectivamente observable:
</p>

<p>
Es parcialmente observable, pero el agente tiene acceso a la
información necesaria para actiar.
</p></li>

<li>No Observables</li>
</ol>
</div>
</li>

<li><a id="orgfdddcf9"></a>Número de Agentes<br />
<div class="outline-text-6" id="text-orgfdddcf9">
<ol class="org-ol">
<li><p>
Agente individual:
</p>

<p>
Sólo actúa el agente.
</p></li>

<li><p>
Multiagente:
</p>

<p>
2.1. Competitivos: Maximizar el rendimiento de un agente
implica minimizar el de otro.
</p>

<p>
2.2. Cooperativos: Maximizar el rendimiento de uno, también
maximiza el de otro.
</p></li>
</ol>
</div>
</li>

<li><a id="org626c64e"></a>Determinismo<br />
<div class="outline-text-6" id="text-org626c64e">
<ol class="org-ol">
<li><p>
Determinista:
</p>

<p>
En donde los estados del entorno está completamente
determinados por el estado anterior y la acción del agente.
</p></li>

<li>Estocástico ~ No determinista.</li>

<li><p>
Estratégico:
</p>

<p>
Es un entorno determinista, pero puede ser afectado por las
acciones de otro agente.
</p></li>
</ol>
</div>
</li>

<li><a id="orgd7c8b2a"></a>Secuencialidad<br />
<div class="outline-text-6" id="text-orgd7c8b2a">
<ol class="org-ol">
<li><p>
Episódicos:
</p>

<p>
Están divididos en episodios, en donde un episodio no afecta
a futuros episódicos.
</p></li>

<li><p>
Secuenciales:
</p>

<p>
Las decisiones actuales afectan a los estados futuros.
</p></li>
</ol>
</div>
</li>

<li><a id="org79cc53a"></a>Dinamicidad<br />
<div class="outline-text-6" id="text-org79cc53a">
<ol class="org-ol">
<li><p>
Estáticos:
</p>

<p>
En donde sólamente se modifican por acciones del agente.
</p></li>

<li><p>
Dinámicos:
</p>

<p>
Se modifican sin necesidad de que el agente participe.
</p></li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga7f73ac" class="outline-3">
<h3 id="orga7f73ac">Clase 9</h3>
<div class="outline-text-3" id="text-orga7f73ac">
</div>
<div id="outline-container-org2204113" class="outline-4">
<h4 id="org2204113">Tipos de Ambientes</h4>
<div class="outline-text-4" id="text-org2204113">
</div>
<ul class="org-ul">
<li><a id="org35bea92"></a>Continuidad<br />
<div class="outline-text-5" id="text-org35bea92">
<ol class="org-ol">
<li><p>
Entorno discreto:
</p>

<p>
Cuya estructura es discreta.
</p></li>

<li><p>
Entorno contínuo:
</p>

<p>
Cuya estructura es continuo.
</p></li>
</ol>
</div>
</li>

<li><a id="org69fd141"></a>Información<br />
<div class="outline-text-5" id="text-org69fd141">
<ol class="org-ol">
<li><p>
Conocidos:
</p>

<p>
Son aquellos en donde el agente tiene toda la información de
manera previa.
</p></li>

<li><p>
Desconocidos:
</p>

<p>
Donde se tiene información parcial o ninguna sobre el
ambiente.
</p></li>
</ol>
</div>
</li>
</ul>
</div>

<div id="outline-container-org5474772" class="outline-4">
<h4 id="org5474772">Ejemplo</h4>
<div class="outline-text-4" id="text-org5474772">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Obs</th>
<th scope="col" class="org-left">Núm</th>
<th scope="col" class="org-left">Determ</th>
<th scope="col" class="org-left">Sec</th>
<th scope="col" class="org-left">Din</th>
<th scope="col" class="org-left">Cont</th>
<th scope="col" class="org-left">Info</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Mundo</td>
<td class="org-left">Total/</td>
<td class="org-left">Ind</td>
<td class="org-left">Determ</td>
<td class="org-left">Episódico</td>
<td class="org-left">Estático</td>
<td class="org-left">Discreto</td>
<td class="org-left">Conocido</td>
</tr>

<tr>
<td class="org-left">Asp</td>
<td class="org-left">Parcial</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Ajedrez</td>
<td class="org-left">Total</td>
<td class="org-left">Comp</td>
<td class="org-left">Estrat</td>
<td class="org-left">Secuenc</td>
<td class="org-left">Estático</td>
<td class="org-left">Discreto</td>
<td class="org-left">Conocido</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org61a3b5e" class="outline-4">
<h4 id="org61a3b5e">Estructura de Agentes</h4>
<div class="outline-text-4" id="text-org61a3b5e">
</div>
<ul class="org-ul">
<li><a id="org0dc6c1f"></a>Función del agente<br />
<div class="outline-text-5" id="text-org0dc6c1f">
<p>
Mapea un secuencia de percepciones a acciones.
</p>
</div>
</li>

<li><a id="org3257363"></a>Programa del agente<br />
<div class="outline-text-5" id="text-org3257363">
<p>
La implementación de la función del agente.
</p>
</div>
</li>

<li><a id="org9cb2de8"></a>Arquitectura del agente<br />
<div class="outline-text-5" id="text-org9cb2de8">
<p>
Es la parte física del agente, que cuenta con los sensores y los
actuadores.
</p>

<p>
Agente \(=\) Programa \(+\) Arquitectura
</p>

<p>
Entorno \(\rightarrow\) Sensores \(\rightarrow\) Percepciones \(\rightarrow\) Programa \(\rightarrow\) Acción \(\rightarrow\) Actuadores \(\rightarrow\) Entorno
</p>
</div>
</li>

<li><a id="org096d792"></a>Tipos de Agentes<br />
<div class="outline-text-5" id="text-org096d792">
<ol class="org-ol">
<li><p>
Agente dirigido mediante tabla.
</p>

<p>
Toma una tabla que asocia las percepciones a acciones
específicas y en base a las percepciones consulta a la tabla y
elige una ación.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Percepciones</th>
<th scope="col" class="org-left">Acciones</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">p1</td>
<td class="org-left">a1</td>
</tr>

<tr>
<td class="org-left">p2</td>
<td class="org-left">a2</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>

<tr>
<td class="org-left">p1 &#x2026; pt</td>
<td class="org-left">at</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-prog">funcion TABLE_DRIVEN_AGENT(p, table)
        percepciones &lt;- percepciones ++ {p}
        accion &lt;- CONSULTA(percepciones, tabla)
        return accion
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TableDrivenAgent</span>(VacuumWorld):

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, table, location=<span style="font-weight: bold; text-decoration: underline;">None</span>):
        <span style="font-weight: bold;">self</span>.location
</pre>
</div>

<p>
etc&#x2026;
</p></li>
</ol>
</div>
</li>
</ul>
</div>
</div>
