content/notas/IA/Notas.org
*** Agentes de Trabajo (PEAS)

    Consta de el rendimiento, el ambiente, los actuadores y los
    sensores del ambiente.

    | Tipo Agente | Medida de         | Ambiente     | Actuadores | Sensores     |
    |             | rendimiento       |              |            |              |
    |-------------+-------------------+--------------+------------+--------------|
    | Chofer      | Seguro            | Caminos      | Acelerador | Cámaras      |
    | autónomo    | Viaje confortable | Avenidas     | Freno      | Radar        |
    |             | Amabilidad        | Calles       | Luces      | Velocímetro  |
    |             |                   | Clientes     |            |              |
    |             |                   | Policías     |            |              |
    |             |                   | Señales      |            |              |
    |-------------+-------------------+--------------+------------+--------------|
    | Brazo       | No maltratar las  | Bodega       | Brazos     | Proximidad   |
    | autónomo    | cajas             | Trabajadores | Dedos      | Coordinación |
    | acomodador  | Acomodar bien     |              |            |              |
    | de cajas    |                   |              |            |              |

**** Clasificación de ambientes de trabajo

     - Ambiente de trabajo totalmente observable

     - Parcialmente observable

     - Agente único

     - Multiagente

       - Competitivo

       - Cooperativo

     - Determinista

     - No determinista

       - Estocástico

     - Episódico

     - Secuencial

     - Estático

     - Dinámico

     - Conocido

     - Desconocido

** Clase 11
*** Tipos de Agentes

    1. Agente dirigido mediante tabla.

       Selecciona una acción con base a una tabla de secuencia de
       percepciones-acción.

    2. Agente Reactivo Simple.

       Decide una acción con base únicamente a la percepción
       actual. Lo hace con base a reglas condición-acción.

    3. Agentes basados en objetivo

       Buscan la solución a un problema dado una meta.

    4. Agente reactivo basado en modelos.

       Toma decisiones con base a un modelo del mundo, que cuenta con:

       - Modelo de transición

	 Cómo cambia el mundo.

       - Modelo sensor

	 Interpreta las percepciones.

    5. Agente basado en utilidad.

       Toma en cuenta una función de utilidad.

       Se utilizan procesos de decisión Markoviana y Q-Lerning.

    6. Agentes que aprenden.

       Son agentes que mejoran su desempeño con base a la experiencia.

       También se le conoce como Aprendizaje de máquina.
       
*** Algoritmos de búsqueda

    * Planeación:

      Una secuencia de acciones que permiten llegar a una meta

    * Agente se resolución de problemas:

      Son agentes basados en objetivos que buscan una planeación
      óptima para resolver el problema, mediante algoritmos de
      búsqueda.

**** Tipos de búsqueda

     1. Desinformada.

	No cuenta con información de qué tan cerca estamos de la meta.

     2. Informada / Heurística

	Cuenta con información sobre la meta.

**** Problema de búsqueda

     Lo podemos ver como una tupla $SP=(S,A,S_0,F,T,c)$, donde

     1. $S=\{S_0,S_1,\ldots,S_m\}$ es un conjunto de estados.
     2. $A=\{a_0,\ldots,a_n\}$ es el conjunto de acciones.
     3. $S_0$ va a ser el estado inicial.
     4. $F\subseteq S$ va a ser el conjunto de estados finales.
     5. $T:S\times A\rightarrow S$ es una función de transición.
     6. $c:S\times A\times S\rightarrow\mathbb{R}^{+}$ es una función de costo.

** Clase 12
*** Ejemplo problema de búsqeda

    En el mundo de la aspiradora, tendríamos los siguientes estados.

    \[S=\{(x,\ell),x_{\text{loc}},\ell_{\text{suc}}\}\]

    como es un ambiente parcialmente observable, seguimos que el
    problema de búsqueda no sería determinista.

    Si suponemos que el mundo de la aspíradora es totalmente
    observable, tendríamos entonces un problema determinista.
    
*** Camino

    Dada la gráfica de un problema, un camino es una sucesión de
    acciones $a_1,\ldots,a_n\in A^*$.

**** Solución

     Es un camino $a_1,\ldots,a_n\in A^*$ tal que partimos de $s_0$ y
     llegamos a $s_f\in F$.

**** Solución óptima

     Es una solución tal que

     \[\hat{a}_1,\ldots,\hat{a}_n=\arg\min_{a_1,\ldots,a_m}\sum_{a_i}c(s_q,a_i,s_p)\]

*** Algoritmos de búsqueda

    Un algoritmo de búsqueda toma como entrada un problema de búsqueda
    y devuelve una solución.

*** Árbol de búsqueda

    Es un árbol ordenado con raíz, tal que esta raíz se asocia a su
    estado inicial, y los hijos son los estados que derivan de
    acciones.

    $T=(V,\varepsilon)$ $V\equiv S$ $\varepsilon\equiv A$

*** Estructuruda de nodos.

    Un nodo va a contar con:

    1. Elemento ~ Estado
    2. Padre
    3. Acción
    4. Costo
    5. Profundidad

*** Función de expansión de nodos en el árbol de búsqueda.

    #+begin_src prog
func EXPAND(n, SP)
     s <- n.estado
     for a in A do
     	 s' <- T(s,a)
	 n' <- CREATENODE(s',n,a,SP)
	 yield n'
    #+end_src

** Clase 13
*** Algoritmos de búsqueda

    - Árbol de búsqueda $T=(V,E)$

      Los nodos serán estados empezando por $s_0$, que sería la raíz.

    - Aristas ~ Acciones. El árbol se genera a partir de expandir los
      nodos.
      
*** Frontera

    Aquellos nodos que no han sido expandidos en el árbol de búsqueda
    en un tiempo $t$.

