notas/IA/Notas.html

<div id="outline-container-orgb6ba7cd" class="outline-3">
<h3 id="orgb6ba7cd">Clase 10</h3>
<div class="outline-text-3" id="text-orgb6ba7cd">
</div>
<div id="outline-container-org237c733" class="outline-4">
<h4 id="org237c733">Agentes de Trabajo (PEAS)</h4>
<div class="outline-text-4" id="text-org237c733">
<p>
Consta de el rendimiento, el ambiente, los actuadores y los
sensores del ambiente.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipo Agente</th>
<th scope="col" class="org-left">Medida de</th>
<th scope="col" class="org-left">Ambiente</th>
<th scope="col" class="org-left">Actuadores</th>
<th scope="col" class="org-left">Sensores</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">rendimiento</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Chofer</td>
<td class="org-left">Seguro</td>
<td class="org-left">Caminos</td>
<td class="org-left">Acelerador</td>
<td class="org-left">Cámaras</td>
</tr>

<tr>
<td class="org-left">autónomo</td>
<td class="org-left">Viaje confortable</td>
<td class="org-left">Avenidas</td>
<td class="org-left">Freno</td>
<td class="org-left">Radar</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Amabilidad</td>
<td class="org-left">Calles</td>
<td class="org-left">Luces</td>
<td class="org-left">Velocímetro</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Clientes</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Policías</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Señales</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Brazo</td>
<td class="org-left">No maltratar las</td>
<td class="org-left">Bodega</td>
<td class="org-left">Brazos</td>
<td class="org-left">Proximidad</td>
</tr>

<tr>
<td class="org-left">autónomo</td>
<td class="org-left">cajas</td>
<td class="org-left">Trabajadores</td>
<td class="org-left">Dedos</td>
<td class="org-left">Coordinación</td>
</tr>

<tr>
<td class="org-left">acomodador</td>
<td class="org-left">Acomodar bien</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">de cajas</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<ul class="org-ul">
<li><a id="orgaff9a8b"></a>Clasificación de ambientes de trabajo<br />
<div class="outline-text-5" id="text-orgaff9a8b">
<ul class="org-ul">
<li>Ambiente de trabajo totalmente observable</li>

<li>Parcialmente observable</li>

<li>Agente único</li>

<li>Multiagente

<ul class="org-ul">
<li>Competitivo</li>

<li>Cooperativo</li>
</ul></li>

<li>Determinista</li>

<li>No determinista

<ul class="org-ul">
<li>Estocástico</li>
</ul></li>

<li>Episódico</li>

<li>Secuencial</li>

<li>Estático</li>

<li>Dinámico</li>

<li>Conocido</li>

<li>Desconocido</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7b84524" class="outline-3">
<h3 id="org7b84524">Clase 11</h3>
<div class="outline-text-3" id="text-org7b84524">
</div>
<div id="outline-container-org2a2802f" class="outline-4">
<h4 id="org2a2802f">Tipos de Agentes</h4>
<div class="outline-text-4" id="text-org2a2802f">
<ol class="org-ol">
<li><p>
Agente dirigido mediante tabla.
</p>

<p>
Selecciona una acción con base a una tabla de secuencia de
percepciones-acción.
</p></li>

<li><p>
Agente Reactivo Simple.
</p>

<p>
Decide una acción con base únicamente a la percepción
actual. Lo hace con base a reglas condición-acción.
</p></li>

<li><p>
Agentes basados en objetivo
</p>

<p>
Buscan la solución a un problema dado una meta.
</p></li>

<li><p>
Agente reactivo basado en modelos.
</p>

<p>
Toma decisiones con base a un modelo del mundo, que cuenta con:
</p>

<ul class="org-ul">
<li><p>
Modelo de transición
</p>

<p>
Cómo cambia el mundo.
</p></li>

<li><p>
Modelo sensor
</p>

<p>
Interpreta las percepciones.
</p></li>
</ul></li>

<li><p>
Agente basado en utilidad.
</p>

<p>
Toma en cuenta una función de utilidad.
</p>

<p>
Se utilizan procesos de decisión Markoviana y Q-Lerning.
</p></li>

<li><p>
Agentes que aprenden.
</p>

<p>
Son agentes que mejoran su desempeño con base a la experiencia.
</p>

<p>
También se le conoce como Aprendizaje de máquina.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org5293170" class="outline-4">
<h4 id="org5293170">Algoritmos de búsqueda</h4>
<div class="outline-text-4" id="text-org5293170">
<ul class="org-ul">
<li><p>
Planeación:
</p>

<p>
Una secuencia de acciones que permiten llegar a una meta
</p></li>

<li><p>
Agente se resolución de problemas:
</p>

<p>
Son agentes basados en objetivos que buscan una planeación
óptima para resolver el problema, mediante algoritmos de
búsqueda.
</p></li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgeaee91c"></a>Tipos de búsqueda<br />
<div class="outline-text-5" id="text-orgeaee91c">
<ol class="org-ol">
<li><p>
Desinformada.
</p>

<p>
No cuenta con información de qué tan cerca estamos de la meta.
</p></li>

<li><p>
Informada / Heurística
</p>

<p>
Cuenta con información sobre la meta.
</p></li>
</ol>
</div>
</li>

<li><a id="org4e54d18"></a>Problema de búsqueda<br />
<div class="outline-text-5" id="text-org4e54d18">
<p>
Lo podemos ver como una tupla \(SP=(S,A,S_0,F,T,c)\), donde
</p>

<ol class="org-ol">
<li>\(S=\{S_0,S_1,\ldots,S_m\}\) es un conjunto de estados.</li>
<li>\(A=\{a_0,\ldots,a_n\}\) es el conjunto de acciones.</li>
<li>\(S_0\) va a ser el estado inicial.</li>
<li>\(F\subseteq S\) va a ser el conjunto de estados finales.</li>
<li>\(T:S\times A\rightarrow S\) es una función de transición.</li>
<li>\(c:S\times A\times S\rightarrow\mathbb{R}^{+}\) es una función de costo.</li>
</ol>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgaf94aca" class="outline-3">
<h3 id="orgaf94aca">Clase 12</h3>
<div class="outline-text-3" id="text-orgaf94aca">
</div>
<div id="outline-container-orgb2287ce" class="outline-4">
<h4 id="orgb2287ce">Ejemplo problema de búsqeda</h4>
<div class="outline-text-4" id="text-orgb2287ce">
<p>
En el mundo de la aspiradora, tendríamos los siguientes estados.
</p>

<p>
\[S=\{(x,\ell),x_{\text{loc}},\ell_{\text{suc}}\}\]
</p>

<p>
como es un ambiente parcialmente observable, seguimos que el
problema de búsqueda no sería determinista.
</p>

<p>
Si suponemos que el mundo de la aspíradora es totalmente
observable, tendríamos entonces un problema determinista.
</p>
</div>
</div>

<div id="outline-container-orgba4197a" class="outline-4">
<h4 id="orgba4197a">Camino</h4>
<div class="outline-text-4" id="text-orgba4197a">
<p>
Dada la gráfica de un problema, un camino es una sucesión de
acciones \(a_1,\ldots,a_n\in A^*\).
</p>
</div>

<ul class="org-ul">
<li><a id="org52d36bf"></a>Solución<br />
<div class="outline-text-5" id="text-org52d36bf">
<p>
Es un camino \(a_1,\ldots,a_n\in A^*\) tal que partimos de \(s_0\) y
llegamos a \(s_f\in F\).
</p>
</div>
</li>

<li><a id="orgc064a40"></a>Solución óptima<br />
<div class="outline-text-5" id="text-orgc064a40">
<p>
Es una solución tal que
</p>

<p>
\[\hat{a}_1,\ldots,\hat{a}_n=\arg\min_{a_1,\ldots,a_m}\sum_{a_i}c(s_q,a_i,s_p)\]
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org123c19d" class="outline-4">
<h4 id="org123c19d">Algoritmos de búsqueda</h4>
<div class="outline-text-4" id="text-org123c19d">
<p>
Un algoritmo de búsqueda toma como entrada un problema de búsqueda
y devuelve una solución.
</p>
</div>
</div>

<div id="outline-container-orgaee9550" class="outline-4">
<h4 id="orgaee9550">Árbol de búsqueda</h4>
<div class="outline-text-4" id="text-orgaee9550">
<p>
Es un árbol ordenado con raíz, tal que esta raíz se asocia a su
estado inicial, y los hijos son los estados que derivan de
acciones.
</p>

<p>
\(T=(V,\varepsilon)\) \(V\equiv S\) \(\varepsilon\equiv A\)
</p>
</div>
</div>

<div id="outline-container-orgfa26049" class="outline-4">
<h4 id="orgfa26049">Estructuruda de nodos.</h4>
<div class="outline-text-4" id="text-orgfa26049">
<p>
Un nodo va a contar con:
</p>

<ol class="org-ol">
<li>Elemento ~ Estado</li>
<li>Padre</li>
<li>Acción</li>
<li>Costo</li>
<li>Profundidad</li>
</ol>
</div>
</div>

<div id="outline-container-org828c749" class="outline-4">
<h4 id="org828c749">Función de expansión de nodos en el árbol de búsqueda.</h4>
<div class="outline-text-4" id="text-org828c749">
<div class="org-src-container">
<pre class="src src-prog">func EXPAND(n, SP)
     s &lt;- n.estado
     for a in A do
         s' &lt;- T(s,a)
         n' &lt;- CREATENODE(s',n,a,SP)
         yield n'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga6d921b" class="outline-3">
<h3 id="orga6d921b">Clase 13</h3>
<div class="outline-text-3" id="text-orga6d921b">
</div>
<div id="outline-container-org1a1eeb8" class="outline-4">
<h4 id="org1a1eeb8">Algoritmos de búsqueda</h4>
<div class="outline-text-4" id="text-org1a1eeb8">
<ul class="org-ul">
<li><p>
Árbol de búsqueda \(T=(V,E)\)
</p>

<p>
Los nodos serán estados empezando por \(s_0\), que sería la raíz.
</p></li>

<li>Aristas ~ Acciones. El árbol se genera a partir de expandir los
nodos.</li>
</ul>
</div>
</div>

<div id="outline-container-org71dc9ac" class="outline-4">
<h4 id="org71dc9ac">Frontera</h4>
<div class="outline-text-4" id="text-org71dc9ac">
<p>
Aquellos nodos que no han sido expandidos en el árbol de búsqueda
en un tiempo \(t\).
</p>
</div>
</div>
