content/notas/IA/Notas.org
*** Tipos de pila

    1. LIFO (/Last In First Out/).

       Saca primero el último que entra.

    2. FIFO (/First In First Out/).

       Saca primero el primero que entra.

    3. Prioridad.

       Saca primero al elemento con mayor prioridad, según una función
       $f$.

*** Algoritmo Primero Mejor

    #+begin_src prog
function PM(problem)
	 n <- CREATENODE(s0)
	 frontier <- PRIORITYQUEUE(f).push(n)
	 reached <- TABLE(s0:n)
	 while (frontier != EMPTY) do
	       n <- frontier.pop()
	       if n in problem.F then
	       	       return n
	       fi
	       for child in EXPAND(problem, n) do
	       	   s <- child.STATE
		   if s not in reached or child.cost < reached[s].cost do
		      reached[s] <- child
		      frontier.push(child)
	       done
	 done
end
    #+end_src

*** Algoritmo Primero en Amplitud

    \[f=\min(depth(n))\]

    La solución implica el uso de una pila /FIFO/.

** Clase 14
*** Algoritmo A*

    Vamos a tener una función para decidir a qué estado movernos

    \[f(n)=g(n)+h(n)\]

    donde $g(n)$ va a ser el costo acumulado y $h(n)$ es la heurística
    del costo de la transición a otro estado.
** Clase 15
*** Algoritmos de búsqueda

    1. Árbol de búsqueda

      1.1. Nodos

        a. Estado

	b. Padre

	c. Acción

	d. Profundidad

	e. Costo

      1.2. Frontera

        Éstos son los nodos no expandidos, para los cuales se utilizan
       los siguientes tipos de pilas:

       - FIFO

       - LIFO

       - Pila de Prioridad
	 
*** Estrategias para encontrar un final

    1. Early-Goal Test

       Revisa si el estado es final inmediatamente cuando el nodo es
       expandido.

    2. Late-Goal Test

       Revisa si el estado es final cuando se retira de la pila.

*** Algoritmo primero en amplitud

    #+begin_src prog
function BFS(problem)
	 n <- CREATE-NODE(s0)
	 frontier <- FIFOQUEUE().push(n)
	 reached <- TABLE(s0:n)
	 while frontier != EMPTY do
	       n <- frontier.pop()
	       if n in F then
	       	  return n
	       fi
	       s <- child.STATE
	       if s not in reached then
	       	  frontier.push(child)
		  reached[s] <- child
	       fi
	 done
end
    #+end_src

*** Algoritmos de búsqueda desinformada

    - Primero en amplitud. /FIFO/
    - Dijkstra.
    - Primero en profundidad. /LIFO/

** Clase 16
*** Algoritmos de búsqueda desinformaada

    1. Dijkstra

    2. Primero en Amplitud

    3. Primero en profundidad

       3.1 Profundidad Limitada
       
**** Profundidad Limitada

     #+begin_src python
def DepthLimitedSearch(problem,l):
    """Algoritmo Depth-Limited Search"""
    #Almacenamiento de nodos
    nodes = []
    #Nodo inicial
    node = Node()
    node.state = problem.initial    
    #Frontera con cola de prioridad
    frontier = LIFOQueue()
    frontier.push(node)
    #Nodos alcanzados
    reached = {problem.initial:node}
    #resultado
    result = "failure"

    #Mientras la frontera no esté vacía
    while frontier.isEmpty() == False:
        #Pop en frontera
        node = frontier.pop()
        #Guarda el nodo en la lista
        nodes.append(node)
        
        if problem.is_goal(node.state):
            print("Se encontró solución")
            return nodes
        if node.depth > l:
            result = "cutoff"
        else:
            for child in expand(problem, node):
                state = child.state
                if state not in reached.keys():
                    reached[state] = child
                    frontier.push(child)
    
    return result
     #+end_src

**** Profundidad iterativa

     #+begin_src python
def IterativeDeepeningSearch(problem):
    """Algoritmo de Iterative Deepening Search."""
    #Inicializa la profundidad
    l = 0
    #Revisa si hay resultados
    result = DepthLimitedSearch(problem,l)
    #Itera hasta encontrar una solución
    while result == "cutoff":
        #Agrega una profundidad más
        l += 1
        #Revisa el resultado
        result = DepthLimitedSearch(problem,l)
    
    print("Resuelto en {} iteraciones".format(l))
    return result
     #+end_src

** Clase 17   
*** Búsqueda heurística (informada)

    En ésta, la estrategia es tomar información de la posición de las
    metas.
    
**** Función heurística

     Es una función $h:V\rightarrow\mathbb{R}$, no dará información
     sobre la meta.

***** Primero Mejor Ambicioso (/Greedy BFS/)

      En un Primero Mejor, donde $f$ está dada como:

      \[f(n)=h(n)\] ~~ Pila de prioridad

***** Algoritmo A*

      Toma como función $f$

      \[f(n)=c(n)+h(n)\] ~~ Pila de prioridad

