notas/IA/Notas.html

<div id="outline-container-org7b41e3f" class="outline-4">
<h4 id="org7b41e3f">Tipos de pila</h4>
<div class="outline-text-4" id="text-org7b41e3f">
<ol class="org-ol">
<li><p>
LIFO (<i>Last In First Out</i>).
</p>

<p>
Saca primero el último que entra.
</p></li>

<li><p>
FIFO (<i>First In First Out</i>).
</p>

<p>
Saca primero el primero que entra.
</p></li>

<li><p>
Prioridad.
</p>

<p>
Saca primero al elemento con mayor prioridad, según una función
\(f\).
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org3e5448b" class="outline-4">
<h4 id="org3e5448b">Algoritmo Primero Mejor</h4>
<div class="outline-text-4" id="text-org3e5448b">
<div class="org-src-container">
<pre class="src src-prog">function PM(problem)
         n &lt;- CREATENODE(s0)
         frontier &lt;- PRIORITYQUEUE(f).push(n)
         reached &lt;- TABLE(s0:n)
         while (frontier != EMPTY) do
               n &lt;- frontier.pop()
               if n in problem.F then
                       return n
               fi
               for child in EXPAND(problem, n) do
                   s &lt;- child.STATE
                   if s not in reached or child.cost &lt; reached[s].cost do
                      reached[s] &lt;- child
                      frontier.push(child)
               done
         done
end
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd86f5c5" class="outline-4">
<h4 id="orgd86f5c5">Algoritmo Primero en Amplitud</h4>
<div class="outline-text-4" id="text-orgd86f5c5">
<p>
\[f=\min(depth(n))\]
</p>

<p>
La solución implica el uso de una pila <i>FIFO</i>.
</p>
</div>
</div>
</div>

<div id="outline-container-org31ba351" class="outline-3">
<h3 id="org31ba351">Clase 14</h3>
<div class="outline-text-3" id="text-org31ba351">
</div>
<div id="outline-container-orgb06442d" class="outline-4">
<h4 id="orgb06442d">Algoritmo A*</h4>
<div class="outline-text-4" id="text-orgb06442d">
<p>
Vamos a tener una función para decidir a qué estado movernos
</p>

<p>
\[f(n)=g(n)+h(n)\]
</p>

<p>
donde \(g(n)\) va a ser el costo acumulado y \(h(n)\) es la heurística
del costo de la transición a otro estado.
</p>
</div>
</div>
</div>
<div id="outline-container-org62e269a" class="outline-3">
<h3 id="org62e269a">Clase 15</h3>
<div class="outline-text-3" id="text-org62e269a">
</div>
<div id="outline-container-org9e034b0" class="outline-4">
<h4 id="org9e034b0">Algoritmos de búsqueda</h4>
<div class="outline-text-4" id="text-org9e034b0">
<ol class="org-ol">
<li><p>
Árbol de búsqueda
</p>

<p>
1.1. Nodos
</p>

<p>
a. Estado
</p>

<p>
b. Padre
</p>

<p>
c. Acción
</p>

<p>
d. Profundidad
</p>

<p>
e. Costo
</p>

<p>
1.2. Frontera
</p>

<p>
 Éstos son los nodos no expandidos, para los cuales se utilizan
los siguientes tipos de pilas:
</p>

<ul class="org-ul">
<li>FIFO</li>

<li>LIFO</li>

<li>Pila de Prioridad</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orge9ca4ec" class="outline-4">
<h4 id="orge9ca4ec">Estrategias para encontrar un final</h4>
<div class="outline-text-4" id="text-orge9ca4ec">
<ol class="org-ol">
<li><p>
Early-Goal Test
</p>

<p>
Revisa si el estado es final inmediatamente cuando el nodo es
expandido.
</p></li>

<li><p>
Late-Goal Test
</p>

<p>
Revisa si el estado es final cuando se retira de la pila.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org30784f2" class="outline-4">
<h4 id="org30784f2">Algoritmo primero en amplitud</h4>
<div class="outline-text-4" id="text-org30784f2">
<div class="org-src-container">
<pre class="src src-prog">function BFS(problem)
         n &lt;- CREATE-NODE(s0)
         frontier &lt;- FIFOQUEUE().push(n)
         reached &lt;- TABLE(s0:n)
         while frontier != EMPTY do
               n &lt;- frontier.pop()
               if n in F then
                  return n
               fi
               s &lt;- child.STATE
               if s not in reached then
                  frontier.push(child)
                  reached[s] &lt;- child
               fi
         done
end
</pre>
</div>
</div>
</div>

<div id="outline-container-orge71a9b3" class="outline-4">
<h4 id="orge71a9b3">Algoritmos de búsqueda desinformada</h4>
<div class="outline-text-4" id="text-orge71a9b3">
<ul class="org-ul">
<li>Primero en amplitud. <i>FIFO</i></li>
<li>Dijkstra.</li>
<li>Primero en profundidad. <i>LIFO</i></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org340b1d0" class="outline-3">
<h3 id="org340b1d0">Clase 16</h3>
<div class="outline-text-3" id="text-org340b1d0">
</div>
<div id="outline-container-orge58d09f" class="outline-4">
<h4 id="orge58d09f">Algoritmos de búsqueda desinformaada</h4>
<div class="outline-text-4" id="text-orge58d09f">
<ol class="org-ol">
<li>Dijkstra</li>

<li>Primero en Amplitud</li>

<li><p>
Primero en profundidad
</p>

<p>
3.1 Profundidad Limitada
</p></li>
</ol>
</div>

<ul class="org-ul">
<li><a id="orge5b0993"></a>Profundidad Limitada<br />
<div class="outline-text-5" id="text-orge5b0993">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">DepthLimitedSearch</span>(problem,l):
    <span style="font-style: italic;">"""Algoritmo Depth-Limited Search"""</span>
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Almacenamiento de nodos</span>
    <span style="font-weight: bold; font-style: italic;">nodes</span> = []
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Nodo inicial</span>
    <span style="font-weight: bold; font-style: italic;">node</span> = Node()
    node.<span style="font-weight: bold; font-style: italic;">state</span> = problem.initial    
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Frontera con cola de prioridad</span>
    <span style="font-weight: bold; font-style: italic;">frontier</span> = LIFOQueue()
    frontier.push(node)
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Nodos alcanzados</span>
    <span style="font-weight: bold; font-style: italic;">reached</span> = {problem.initial:node}
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">resultado</span>
    <span style="font-weight: bold; font-style: italic;">result</span> = <span style="font-style: italic;">"failure"</span>

    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Mientras la frontera no est&#233; vac&#237;a</span>
    <span style="font-weight: bold;">while</span> frontier.isEmpty() == <span style="font-weight: bold; text-decoration: underline;">False</span>:
        <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Pop en frontera</span>
        <span style="font-weight: bold; font-style: italic;">node</span> = frontier.pop()
        <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Guarda el nodo en la lista</span>
        nodes.append(node)

        <span style="font-weight: bold;">if</span> problem.is_goal(node.state):
            <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Se encontr&#243; soluci&#243;n"</span>)
            <span style="font-weight: bold;">return</span> nodes
        <span style="font-weight: bold;">if</span> node.depth &gt; l:
            <span style="font-weight: bold; font-style: italic;">result</span> = <span style="font-style: italic;">"cutoff"</span>
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">for</span> child <span style="font-weight: bold;">in</span> expand(problem, node):
                <span style="font-weight: bold; font-style: italic;">state</span> = child.state
                <span style="font-weight: bold;">if</span> state <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">in</span> reached.keys():
                    <span style="font-weight: bold; font-style: italic;">reached</span>[state] = child
                    frontier.push(child)

    <span style="font-weight: bold;">return</span> result
</pre>
</div>
</div>
</li>

<li><a id="org9fc0745"></a>Profundidad iterativa<br />
<div class="outline-text-5" id="text-org9fc0745">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">IterativeDeepeningSearch</span>(problem):
    <span style="font-style: italic;">"""Algoritmo de Iterative Deepening Search."""</span>
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Inicializa la profundidad</span>
    <span style="font-weight: bold; font-style: italic;">l</span> = 0
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Revisa si hay resultados</span>
    <span style="font-weight: bold; font-style: italic;">result</span> = DepthLimitedSearch(problem,l)
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Itera hasta encontrar una soluci&#243;n</span>
    <span style="font-weight: bold;">while</span> result == <span style="font-style: italic;">"cutoff"</span>:
        <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Agrega una profundidad m&#225;s</span>
        <span style="font-weight: bold; font-style: italic;">l</span> += 1
        <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Revisa el resultado</span>
        <span style="font-weight: bold; font-style: italic;">result</span> = DepthLimitedSearch(problem,l)

    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Resuelto en {} iteraciones"</span>.<span style="font-weight: bold;">format</span>(l))
    <span style="font-weight: bold;">return</span> result
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6e9b346" class="outline-3">
<h3 id="org6e9b346">Clase 17</h3>
<div class="outline-text-3" id="text-org6e9b346">
</div>
<div id="outline-container-org3a78b7d" class="outline-4">
<h4 id="org3a78b7d">Búsqueda heurística (informada)</h4>
<div class="outline-text-4" id="text-org3a78b7d">
<p>
En ésta, la estrategia es tomar información de la posición de las
metas.
</p>
</div>

<ul class="org-ul">
<li><a id="orga9774cb"></a>Función heurística<br />
<div class="outline-text-5" id="text-orga9774cb">
<p>
Es una función \(h:V\rightarrow\mathbb{R}\), no dará información
sobre la meta.
</p>
</div>

<ul class="org-ul">
<li><a id="org03336fa"></a>Primero Mejor Ambicioso (<i>Greedy BFS</i>)<br />
<div class="outline-text-6" id="text-org03336fa">
<p>
En un Primero Mejor, donde \(f\) está dada como:
</p>

<p>
\[f(n)=h(n)\] ~~ Pila de prioridad
</p>
</div>
</li>

<li><a id="org882f539"></a>Algoritmo A*<br />
<div class="outline-text-6" id="text-org882f539">
<p>
Toma como función \(f\)
</p>

<p>
\[f(n)=c(n)+h(n)\] ~~ Pila de prioridad
</p>
</div>
</li>
</ul>
</li>
