content/notas/IA/Notas.org
**** Heurística admisible

     Es aquella que siempre subestima el costo de llegar a una meta.

     Supóngase que $h^*(n)$ representa el costo óptimo; si $h$ es
     admisible, entonces:

     \[\forall n\in V. h(n)\le h^*(n)\]

** Clase 18
*** Agentes que resuelven problemas

    Fases para resolver un problema:

    - Formulación de la meta
    - Formulación del problema
    - Búsqueda

** Clase 19
*** Búsqueda Heurística

    Tiene como base una función que nos da información sobre la meta

    $f:V\rightarrow\mathbb{R}$
    
*** Hint tarea

    Si $h$ es admisible, entonces $A^*$ es óptimo.

    Demostración

    Por reducción al absurdo, Supongamos que $A^*$ no es óptimo, por
    lo que $\exists n$ en la solución tal que $f(n)>C^*$

    Sea $n_0$ el primer nodo tal que $f(n_0)>f^*(n_0)$, etc...

*** Hint práctica

    Distancia manhattan: $|x_1-x_2|+|y_1-y_2|$

**** Definiciones

     Una heurísitca $h_1$ domina sobre otra heurística $h_2$ si

     $h_2\leq h_1$

     Si $h_1$ y $h_2$ son admisibles y $h_1$ domina a $h_2$, entonces

     $h_2\leq h_1\leq h^*$

     Si una heurísitica admisible $h_1$ domina sobre $h_2$, entonces
     $h_1$ expande menos nodeos que $h_2$.

** Clase 20
*** Factor de ramificación efectivo

    Califica la calidad de una heurística.

    $N=\#$ de nodos

    $d=$ produndidad

    $b^*=\#$ de sucesores generados por un nod "típico" para un
    problema de búsqueda

    \[N+1=1+b^*+(b^*)^2+\ldots+(b^*)^d\]

    $b^*\approx N^{\frac{1}{d}}$

    Entre más cerca sea $b^*$ de 1, indica que una heurística tiene
    mayor calidad.

    \[N=\frac{b^{*d+1}-1}{b^*-1}\]

    \[53=\frac{b^{*d+1}-1}{b^*-1}\]

    $\Rightarrow b^*=1.92$

*** Profundidad efectiva

    Califica una heurística según cómo se reduce la profundidad por
    una constante $K_n$.

*** Heurística compuesta

    Dado un nodo $n$ (estado $n$ de mi árbol de búsqueda)

    \[h(n)=\max\{h_1(n),\ldots,h_l(n)\}\]

** Clase 21
*** Búsqueda heurística

    Recordemos que $A^*$ es óptimo si la heurística es admisible.

    \[h(n)\leq h^*(n)\]

    Dominancia heurística; $h_2$ domina a $h_1$ si

    \[h_1(n)\leq h_2(n)\]

    La complejidad de $A^*$ depende de la heurística, de esta manera
    si una heurística $h_1$ domina a otra $h_2$, seguimos entonces que
    usar $h_2$ tiene mayor complejidad.
    
**** Heurísitcas consistentes

     Son aquellas heurísitcas que cumplen que

     \[h(n)\leq c(n,a,n')+h(n')\]

     Donde $n'$ es el nodo siguiente.

***** Heurística monótona

      Es el caso particular en donde
      
      \[h(n)\leq h(n')\]

***** Teorema

      Si $h$ es consistente, entonces $h$ es admisible.

**** Estrategias para buscar heurísitcas

     1. Disminución de Restricciones

	Si tenemos un predicado de la forma \[\left(\bigwedge_{i=1}^n X_i\right)\rightarrow Y\]

	Podemos omitir algunas $X_i$ para $i\in\{1,\ldots,n\}$ para
        simplificar el problema.

     2. Puntos de referencia

	Sea $L=\{L_i\ |\ i\in\{1,\ldots,n\}\}$ el conjunto de puntos
        de referencia, definimos la herística diferencial como:

	\[h(n)=\max_{l\in L}\left\vert C^*(n,l)-C^*(meta,l)\right\vert\]

     3. Heurística de experiencia

	Éste toma en cuenta aprendizaje de experiencias.
     
	\[h(n)=\sum_{i=1}w_ix_i(n)+b\]

	Donde

	1. $x_i(n)\in\mathbb{R}^n$ que describa el estado.

	2. $w_i$ es un valor que se modifica con la experiencia.

**** A* pesado

     \[f(n)=g(n)+\alpha h(n)\]

     donde $\alpha\in\mathbb{R}$ es un factor que pondera la
     influencia de $h$.

     1. Si $\alpha=0$, entonces $f(n)=g(n)$, que sería el Algoritmo de
        Dijkstra.
     2. Si $\alpha\rightarrow\infty$, entonces sería más parecido a
        BFS Greedy.

** Clase 22
*** A* pesado

    \[f(n)=g(n)+\alpha h(n)\] con $\alpha\in\mathbb{R}$
    
*** Búsqueda bidireccional

    Se crean dos árboles de búsqueda y se resuelven dos problemas
    distitnos, el camino normal y el camino en retroceso.

** Clase 23
*** Búsqueda bidireccional

    #+begin_src prog
function Proceed(dir,problem,frontier,reached,reached2) where
	 node <- frontier.pop()
	 for child Expand(problem, node) do
	 s <- child.STATE
	 if s not in reached or child.cost < reached[s].cost then
	    reached[s] <- child
	    frontier.push(s)
	    if s in reached2 then
	       solution_2 <- Solution(dir, reached, reached2)
	       if cost(solution_2) < cost(solution) then
	       	  solution <- solution_2
	       fi
	    fi
	 fi
end
    #+end_src
    
    #+begin_src prog
function BiSearch(problem_f, problem_b) where
	 node_i <- CREATENODE(problem_i, INITIAL) //i\in{f,b}
	 frontier_i <- PriorityQueue(.push(node_i)) //i\in{f,b}
	 reached_i < Table(node_i.STATE : node_i)
	 solution <- failure
	 while frontier_i != EMPTY do
	       if frontier_f.Top.f < frontier_b.Top.f then
	       	  solution <- Proceed ( F
		  	      	      , problem_f
				      , frontier_f
				      , reached_f
				      , reached_b )
	       else
		  solution <- Proceed ( B
		  	      	      , problem_b
				      , frontier_b
				      , reached_b
				      , reached_f )
	       fi
	       return solution
	 done
end
    #+end_src
    
*** Beam Search (búsqueda por haz)

    Toma en cada iteración sólamente los $k$ nodos más prioritarios.

** Clase 24
