notas/IA/Notas.html

<li><a id="org7fa5d5b"></a>Heurística admisible<br />
<div class="outline-text-5" id="text-org7fa5d5b">
<p>
Es aquella que siempre subestima el costo de llegar a una meta.
</p>

<p>
Supóngase que \(h^*(n)\) representa el costo óptimo; si \(h\) es
admisible, entonces:
</p>

<p>
\[\forall n\in V. h(n)\le h^*(n)\]
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1eef5a0" class="outline-3">
<h3 id="org1eef5a0">Clase 18</h3>
<div class="outline-text-3" id="text-org1eef5a0">
</div>
<div id="outline-container-org2f4610d" class="outline-4">
<h4 id="org2f4610d">Agentes que resuelven problemas</h4>
<div class="outline-text-4" id="text-org2f4610d">
<p>
Fases para resolver un problema:
</p>

<ul class="org-ul">
<li>Formulación de la meta</li>
<li>Formulación del problema</li>
<li>Búsqueda</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3f2f219" class="outline-3">
<h3 id="org3f2f219">Clase 19</h3>
<div class="outline-text-3" id="text-org3f2f219">
</div>
<div id="outline-container-org8441c9a" class="outline-4">
<h4 id="org8441c9a">Búsqueda Heurística</h4>
<div class="outline-text-4" id="text-org8441c9a">
<p>
Tiene como base una función que nos da información sobre la meta
</p>

<p>
\(f:V\rightarrow\mathbb{R}\)
</p>
</div>
</div>

<div id="outline-container-org345d89d" class="outline-4">
<h4 id="org345d89d">Hint tarea</h4>
<div class="outline-text-4" id="text-org345d89d">
<p>
Si \(h\) es admisible, entonces \(A^*\) es óptimo.
</p>

<p>
Demostración
</p>

<p>
Por reducción al absurdo, Supongamos que \(A^*\) no es óptimo, por
lo que \(\exists n\) en la solución tal que \(f(n)>C^*\)
</p>

<p>
Sea \(n_0\) el primer nodo tal que \(f(n_0)>f^*(n_0)\), etc&#x2026;
</p>
</div>
</div>

<div id="outline-container-org4d2a746" class="outline-4">
<h4 id="org4d2a746">Hint práctica</h4>
<div class="outline-text-4" id="text-org4d2a746">
<p>
Distancia manhattan: \(|x_1-x_2|+|y_1-y_2|\)
</p>
</div>

<ul class="org-ul">
<li><a id="orgc0fb6e6"></a>Definiciones<br />
<div class="outline-text-5" id="text-orgc0fb6e6">
<p>
Una heurísitca \(h_1\) domina sobre otra heurística \(h_2\) si
</p>

<p>
\(h_2\leq h_1\)
</p>

<p>
Si \(h_1\) y \(h_2\) son admisibles y \(h_1\) domina a \(h_2\), entonces
</p>

<p>
\(h_2\leq h_1\leq h^*\)
</p>

<p>
Si una heurísitica admisible \(h_1\) domina sobre \(h_2\), entonces
\(h_1\) expande menos nodeos que \(h_2\).
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb0e8802" class="outline-3">
<h3 id="orgb0e8802">Clase 20</h3>
<div class="outline-text-3" id="text-orgb0e8802">
</div>
<div id="outline-container-orgf830af7" class="outline-4">
<h4 id="orgf830af7">Factor de ramificación efectivo</h4>
<div class="outline-text-4" id="text-orgf830af7">
<p>
Califica la calidad de una heurística.
</p>

<p>
\(N=\#\) de nodos
</p>

<p>
\(d=\) produndidad
</p>

<p>
\(b^*=\#\) de sucesores generados por un nod "típico" para un
problema de búsqueda
</p>

<p>
\[N+1=1+b^*+(b^*)^2+\ldots+(b^*)^d\]
</p>

<p>
\(b^*\approx N^{\frac{1}{d}}\)
</p>

<p>
Entre más cerca sea \(b^*\) de 1, indica que una heurística tiene
mayor calidad.
</p>

<p>
\[N=\frac{b^{*d+1}-1}{b^*-1}\]
</p>

<p>
\[53=\frac{b^{*d+1}-1}{b^*-1}\]
</p>

<p>
\(\Rightarrow b^*=1.92\)
</p>
</div>
</div>

<div id="outline-container-orgc39f622" class="outline-4">
<h4 id="orgc39f622">Profundidad efectiva</h4>
<div class="outline-text-4" id="text-orgc39f622">
<p>
Califica una heurística según cómo se reduce la profundidad por
una constante \(K_n\).
</p>
</div>
</div>

<div id="outline-container-orgd0145d8" class="outline-4">
<h4 id="orgd0145d8">Heurística compuesta</h4>
<div class="outline-text-4" id="text-orgd0145d8">
<p>
Dado un nodo \(n\) (estado \(n\) de mi árbol de búsqueda)
</p>

<p>
\[h(n)=\max\{h_1(n),\ldots,h_l(n)\}\]
</p>
</div>
</div>
</div>

<div id="outline-container-org06a64ee" class="outline-3">
<h3 id="org06a64ee">Clase 21</h3>
<div class="outline-text-3" id="text-org06a64ee">
</div>
<div id="outline-container-org960546b" class="outline-4">
<h4 id="org960546b">Búsqueda heurística</h4>
<div class="outline-text-4" id="text-org960546b">
<p>
Recordemos que \(A^*\) es óptimo si la heurística es admisible.
</p>

<p>
\[h(n)\leq h^*(n)\]
</p>

<p>
Dominancia heurística; \(h_2\) domina a \(h_1\) si
</p>

<p>
\[h_1(n)\leq h_2(n)\]
</p>

<p>
La complejidad de \(A^*\) depende de la heurística, de esta manera
si una heurística \(h_1\) domina a otra \(h_2\), seguimos entonces que
usar \(h_2\) tiene mayor complejidad.
</p>
</div>

<ul class="org-ul">
<li><a id="org0ee874d"></a>Heurísitcas consistentes<br />
<div class="outline-text-5" id="text-org0ee874d">
<p>
Son aquellas heurísitcas que cumplen que
</p>

<p>
\[h(n)\leq c(n,a,n')+h(n')\]
</p>

<p>
Donde \(n'\) es el nodo siguiente.
</p>
</div>

<ul class="org-ul">
<li><a id="orgaefe49a"></a>Heurística monótona<br />
<div class="outline-text-6" id="text-orgaefe49a">
<p>
Es el caso particular en donde
</p>

<p>
\[h(n)\leq h(n')\]
</p>
</div>
</li>

<li><a id="orgbe73bcc"></a>Teorema<br />
<div class="outline-text-6" id="text-orgbe73bcc">
<p>
Si \(h\) es consistente, entonces \(h\) es admisible.
</p>
</div>
</li>
</ul>
</li>

<li><a id="orgd4eb4fd"></a>Estrategias para buscar heurísitcas<br />
<div class="outline-text-5" id="text-orgd4eb4fd">
<ol class="org-ol">
<li><p>
Disminución de Restricciones
</p>

<p>
Si tenemos un predicado de la forma \[\left(\bigwedge_{i=1}^n X_i\right)\rightarrow Y\]
</p>

<p>
Podemos omitir algunas \(X_i\) para \(i\in\{1,\ldots,n\}\) para
simplificar el problema.
</p></li>

<li><p>
Puntos de referencia
</p>

<p>
Sea \(L=\{L_i\ |\ i\in\{1,\ldots,n\}\}\) el conjunto de puntos
de referencia, definimos la herística diferencial como:
</p>

<p>
\[h(n)=\max_{l\in L}\left\vert C^*(n,l)-C^*(meta,l)\right\vert\]
</p></li>

<li><p>
Heurística de experiencia
</p>

<p>
Éste toma en cuenta aprendizaje de experiencias.
</p>

<p>
\[h(n)=\sum_{i=1}w_ix_i(n)+b\]
</p>

<p>
Donde
</p>

<ol class="org-ol">
<li>\(x_i(n)\in\mathbb{R}^n\) que describa el estado.</li>

<li>\(w_i\) es un valor que se modifica con la experiencia.</li>
</ol></li>
</ol>
</div>
</li>

<li><a id="orgcf9a9dd"></a>A* pesado<br />
<div class="outline-text-5" id="text-orgcf9a9dd">
<p>
\[f(n)=g(n)+\alpha h(n)\]
</p>

<p>
donde \(\alpha\in\mathbb{R}\) es un factor que pondera la
influencia de \(h\).
</p>

<ol class="org-ol">
<li>Si \(\alpha=0\), entonces \(f(n)=g(n)\), que sería el Algoritmo de
Dijkstra.</li>
<li>Si \(\alpha\rightarrow\infty\), entonces sería más parecido a
BFS Greedy.</li>
</ol>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf8c7c1a" class="outline-3">
<h3 id="orgf8c7c1a">Clase 22</h3>
<div class="outline-text-3" id="text-orgf8c7c1a">
</div>
<div id="outline-container-orgb2b2ec4" class="outline-4">
<h4 id="orgb2b2ec4">A* pesado</h4>
<div class="outline-text-4" id="text-orgb2b2ec4">
<p>
\[f(n)=g(n)+\alpha h(n)\] con \(\alpha\in\mathbb{R}\)
</p>
</div>
</div>

<div id="outline-container-orgc19a47b" class="outline-4">
<h4 id="orgc19a47b">Búsqueda bidireccional</h4>
<div class="outline-text-4" id="text-orgc19a47b">
<p>
Se crean dos árboles de búsqueda y se resuelven dos problemas
distitnos, el camino normal y el camino en retroceso.
</p>
</div>
</div>
</div>

<div id="outline-container-org9b4130c" class="outline-3">
<h3 id="org9b4130c">Clase 23</h3>
<div class="outline-text-3" id="text-org9b4130c">
</div>
<div id="outline-container-org65d5f6b" class="outline-4">
<h4 id="org65d5f6b">Búsqueda bidireccional</h4>
<div class="outline-text-4" id="text-org65d5f6b">
<div class="org-src-container">
<pre class="src src-prog">function Proceed(dir,problem,frontier,reached,reached2) where
         node &lt;- frontier.pop()
         for child Expand(problem, node) do
         s &lt;- child.STATE
         if s not in reached or child.cost &lt; reached[s].cost then
            reached[s] &lt;- child
            frontier.push(s)
            if s in reached2 then
               solution_2 &lt;- Solution(dir, reached, reached2)
               if cost(solution_2) &lt; cost(solution) then
                  solution &lt;- solution_2
               fi
            fi
         fi
end
</pre>
</div>

<div class="org-src-container">
<pre class="src src-prog">function BiSearch(problem_f, problem_b) where
         node_i &lt;- CREATENODE(problem_i, INITIAL) //i\in{f,b}
         frontier_i &lt;- PriorityQueue(.push(node_i)) //i\in{f,b}
         reached_i &lt; Table(node_i.STATE : node_i)
         solution &lt;- failure
         while frontier_i != EMPTY do
               if frontier_f.Top.f &lt; frontier_b.Top.f then
                  solution &lt;- Proceed ( F
                                      , problem_f
                                      , frontier_f
                                      , reached_f
                                      , reached_b )
               else
                  solution &lt;- Proceed ( B
                                      , problem_b
                                      , frontier_b
                                      , reached_b
                                      , reached_f )
               fi
               return solution
         done
end
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb548a01" class="outline-4">
<h4 id="orgb548a01">Beam Search (búsqueda por haz)</h4>
<div class="outline-text-4" id="text-orgb548a01">
<p>
Toma en cada iteración sólamente los \(k\) nodos más prioritarios.
</p>
</div>
</div>
</div>
