content/notas/IA/Notas.org
*** Búsquedas en problemas parcialmente observables

    Se tiene que convertir en un problema de creencias.

    1. Los estados van a ser $\hat{S}=\{\hat{S}\subseteq S\}$

    2. Inicial

       - $\hat{S}_0=\{q_0\}$ únicamente si conocemos todo el estado
         inicial.

       - $\hat{S}_0=S$ o bien, depende de lo que observa el agente.

    3. Acciones: Función de acciones legales.

       - $Action(\hat{S},a)=\bigcup_{s\in\hat{S}}Action(s,a)$

       - $\bigcap$

    4. Transiciones: $T:2^S\times A\rightarrow 2^S$

       - $Result(\hat{S},a)=\bigcup_{s\in\hat{S}}Result(s,a)$

    5. Meta:

       - Necesaria $F=\{s_f:\text{final original}\}$

       - Posible $F=\{\hat{S}:s_f\in\hat{S}\}$
** Clase 25
*** Búsqueda por optimización

    *Búsqueda local*: Es realizar la búsqueda de la solución en los
    estados vecinos al estado actual.

    *Entornos*: Parcialmente observables

    *Función objetivo*: Es una función $f:2^S\rightarrow\mathbb{R}$ que
    determina la utilidad de la estrategia actual.
    
*** Ascenso de la colina

    #+begin_src prog
function HILL-CLIMBING(problem)
	 current <- problem.INITIAL
	 while True do
	       neighbour <- argmax f(SUC(current))
	       if f(neighbour) <= f(current) then
	       	  return current
	       else
		  current <- neighbour
	       fi
	 done
end
    #+end_src

*** Algoritmo genético

    *Individuo*: Es un estado del problema codificado genéticamente

    \[i_j=(x_1,x_2,\ldots,x_k)\]

    *Población*: Es un conjunto de individuos; tenemos también:

    - *Población inicial*: Población con la que inicia el alforitmo. Es
      de tamaño $n$.

      El tamaño de la población es el número de individuos que
      conforman la población.


    *Función fitness*: Es una función objetivo
    $f:I\rightarrow\mathbb{R}$ que asigna a cada individuo un valor
    (de fuerza).

    #+begin_src prog
function GENETIC(population, f)
	 wight
    #+end_src
      
** Clase 26
*** Algoritmo genético

    #+begin_src prog
function Genetic(population, f)
    do
	weights <- Weights(population, f)
        population2 <- {}
	    for i = 1 to |population| do
            	parents <- Selection(population, weights)
	    	childs <- Reproduce(parents)
	    	childs <- Mutate(childs)
	    	population2 <- Replace(childs, parents)
    	    done
    	    population <- population2
    while (criterio de paro)
    return argmax_f{population}
end  
    #+end_src
    
**** Selección

     1. Ruleta: Ruleta aleatoria basada en la probabilidad de los
        individuos según su /fitness/.

     2. Aleatoria: La probabilidad es uniforme. Todo individuo tienen
        la misma probabilidad.

     3. Torneo: Se pone a competir a los individuos. Es decir se
        descartan paulatinamente a los individuos más débiles.

**** Reproducción

     1. En un punto: Dados dos padres, corta sus genes en un punto y
        une las mitades.

     2. En $n$ puntos: Similar al anterior, pero se toman varios
        puntos.

     3. Uniforme: Utiliza una máscara que selecciona qué genes
        componen al hijo.

     4. Aleatoria: Combina aleatoriamente los genes.

**** Mutación

     1. Flipping: Cambia el gen usando una máscara.

     2. Intercambio: Intercambiar dos genes aleatoriamente.

     3. Inverso: Se toma una sección de genes y se invierte el orden.

**** Reemplazo

     1. Generacional: Los descendientes reemplazan a los padres.

     2. Fuerte: Se seleccionan aleatoriamente entre padres e hijos.

     3. Débil: Selecciona entre padres e hijos a los más fuertes.

*** ONE MAX

    \[f(x)=\sum_{i=1}^n x_i\]

    Elegimos una población inicial, supongamos:

    \[x_1=(0\ 1\ 0\ 1)\] | 2
    \[x_2=(0\ 0\ 0\ 0)\] | 0
    \[x_3=(1\ 0\ 1\ 1)\] | 3
    \[x_4=(1\ 0\ 1\ 0)\] | 2

** Clase 27

*** Agentes probabilísticos

    Se encuentran en un entorno no determinista, o estocástico.

**** Creencia

     Es una concepción de cómo puede estar el ambiente; puede
     modificarse con más información.

**** Estado de creencia

     Conjunto de creencias que tiene un agente sobre un estado.

*** Teoría de utilidad

    El agente prefiere las acciones que tengan mayor utilidad.

*** Teoría de decisión

    Incorpora la teoría de la utilidad junto con la probabilidad.

    En ésta el agente va a buscar las soluciones que maximicen la
    utilidad _esperada_.

    \[MUE\]

*** Probabilidad

    *Espacio probabilístico:* Es una 3-tupla $(\Omega,\mathcal{F},p)$ tal que:

    - $\Omega$ es el espacio muestral
    - $\mathcal{F}\subseteq 2^{\Omega}$ el conjunto de eventos
    - $p:\mathcal{F}\rightarrow [0,1]$ una función de probabilidad.


    *Variable aleatoria:* Es una función tal que

    \[X:\Omega\rightarrow\mathbb{R}\]

**** Notación

     \[p(X=x)\]

     donde $X$ es la variable aleatorio y $x$ es el valor de $X$

**** Propiedades de $\mathcal{F}$

     1. $\emptyset,\Omega\in\mathcal{F}$
     2. Si $E\in\mathcal{F}$ entonces $E^c\in\mathcal{F}$
     3. $\sigma$ aditividad. Si $E_1,E_2,\ldots\subseteq\mathcal{F}$ entonces

	\[\bigcup_{i=1}^nE_i\in\mathcal{F}\]

**** Propiedades de $p$

     1. $p(\emptyset)=0$
     2. $p(\Omega)=1$
     3. $p(E)\geq 0\ \forall E\in\mathcal{F}$
     4. $\sigma$ - aditividad Si $E_1,E_2,\ldots\subseteq\mathcal{F}$ tales que $\forall i. i\neq j\rightarrow E_i\cap E_j=\emptyset$

	Se tiene que

	\[p\left(\bigcup_{i=1}^n E_i\right)=\sum_{i=1}^np(E_i)\]

**** Probabilidad Conjunta

     \[p(E_1,E_2)=p(E_1\cap E_2)\]

     \[p(E_1,\ldots,E_n)=p\left(\bigcap_{i=1}^nE_i\right)\]

     Diremos que $E_1\bot E_2$ son independientes si

     \[p(E_1,E_2)=p(E_1)p(E_2)\]

**** Probabilidad condicional

     \[p(X_1=x_1|X_2=x_2)=\frac{p(X_1=x_1,X_2=x_2)}{p(X_2=x_2)}\]

     \[p(X_1=x_1|X_2=x_2,X_3=x_3,\ldots,X_n=x_n)=\frac{p\left(\bigcap_{i=1}^nX_i=x_i\right)}{p\left(\bigcap_{i=2}^nX_i=x_i\right)}\]

