notas/IA/Notas.html

<div id="outline-container-orgfc9acff" class="outline-3">
<h3 id="orgfc9acff">Clase 24</h3>
<div class="outline-text-3" id="text-orgfc9acff">
</div>
<div id="outline-container-orgdb71f2f" class="outline-4">
<h4 id="orgdb71f2f">Búsquedas en problemas parcialmente observables</h4>
<div class="outline-text-4" id="text-orgdb71f2f">
<p>
Se tiene que convertir en un problema de creencias.
</p>

<ol class="org-ol">
<li>Los estados van a ser \(\hat{S}=\{\hat{S}\subseteq S\}\)</li>

<li>Inicial

<ul class="org-ul">
<li>\(\hat{S}_0=\{q_0\}\) únicamente si conocemos todo el estado
inicial.</li>

<li>\(\hat{S}_0=S\) o bien, depende de lo que observa el agente.</li>
</ul></li>

<li>Acciones: Función de acciones legales.

<ul class="org-ul">
<li>\(Action(\hat{S},a)=\bigcup_{s\in\hat{S}}Action(s,a)\)</li>

<li>\(\bigcap\)</li>
</ul></li>

<li>Transiciones: \(T:2^S\times A\rightarrow 2^S\)

<ul class="org-ul">
<li>\(Result(\hat{S},a)=\bigcup_{s\in\hat{S}}Result(s,a)\)</li>
</ul></li>

<li>Meta:

<ul class="org-ul">
<li>Necesaria \(F=\{s_f:\text{final original}\}\)</li>

<li>Posible \(F=\{\hat{S}:s_f\in\hat{S}\}\)</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org36ed9ab" class="outline-3">
<h3 id="org36ed9ab">Clase 25</h3>
<div class="outline-text-3" id="text-org36ed9ab">
</div>
<div id="outline-container-org7db66dc" class="outline-4">
<h4 id="org7db66dc">Búsqueda por optimización</h4>
<div class="outline-text-4" id="text-org7db66dc">
<p>
<b>Búsqueda local</b>: Es realizar la búsqueda de la solución en los
estados vecinos al estado actual.
</p>

<p>
<b>Entornos</b>: Parcialmente observables
</p>

<p>
<b>Función objetivo</b>: Es una función \(f:2^S\rightarrow\mathbb{R}\) que
determina la utilidad de la estrategia actual.
</p>
</div>
</div>

<div id="outline-container-org2d75dea" class="outline-4">
<h4 id="org2d75dea">Ascenso de la colina</h4>
<div class="outline-text-4" id="text-org2d75dea">
<div class="org-src-container">
<pre class="src src-prog">function HILL-CLIMBING(problem)
         current &lt;- problem.INITIAL
         while True do
               neighbour &lt;- argmax f(SUC(current))
               if f(neighbour) &lt;= f(current) then
                  return current
               else
                  current &lt;- neighbour
               fi
         done
end
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc6992a3" class="outline-4">
<h4 id="orgc6992a3">Algoritmo genético</h4>
<div class="outline-text-4" id="text-orgc6992a3">
<p>
<b>Individuo</b>: Es un estado del problema codificado genéticamente
</p>

<p>
\[i_j=(x_1,x_2,\ldots,x_k)\]
</p>

<p>
<b>Población</b>: Es un conjunto de individuos; tenemos también:
</p>

<ul class="org-ul">
<li><p>
<b>Población inicial</b>: Población con la que inicia el alforitmo. Es
de tamaño \(n\).
</p>

<p>
El tamaño de la población es el número de individuos que
conforman la población.
</p></li>
</ul>


<p>
<b>Función fitness</b>: Es una función objetivo
\(f:I\rightarrow\mathbb{R}\) que asigna a cada individuo un valor
(de fuerza).
</p>

<div class="org-src-container">
<pre class="src src-prog">function GENETIC(population, f)
         wight
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1b8f5b1" class="outline-3">
<h3 id="org1b8f5b1">Clase 26</h3>
<div class="outline-text-3" id="text-org1b8f5b1">
</div>
<div id="outline-container-orgef4f639" class="outline-4">
<h4 id="orgef4f639">Algoritmo genético</h4>
<div class="outline-text-4" id="text-orgef4f639">
<div class="org-src-container">
<pre class="src src-prog">function Genetic(population, f)
    do
        weights &lt;- Weights(population, f)
        population2 &lt;- {}
            for i = 1 to |population| do
                parents &lt;- Selection(population, weights)
                childs &lt;- Reproduce(parents)
                childs &lt;- Mutate(childs)
                population2 &lt;- Replace(childs, parents)
            done
            population &lt;- population2
    while (criterio de paro)
    return argmax_f{population}
end  
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="orgb6b2c4c"></a>Selección<br />
<div class="outline-text-5" id="text-orgb6b2c4c">
<ol class="org-ol">
<li>Ruleta: Ruleta aleatoria basada en la probabilidad de los
individuos según su <i>fitness</i>.</li>

<li>Aleatoria: La probabilidad es uniforme. Todo individuo tienen
la misma probabilidad.</li>

<li>Torneo: Se pone a competir a los individuos. Es decir se
descartan paulatinamente a los individuos más débiles.</li>
</ol>
</div>
</li>

<li><a id="org9547ad8"></a>Reproducción<br />
<div class="outline-text-5" id="text-org9547ad8">
<ol class="org-ol">
<li>En un punto: Dados dos padres, corta sus genes en un punto y
une las mitades.</li>

<li>En \(n\) puntos: Similar al anterior, pero se toman varios
puntos.</li>

<li>Uniforme: Utiliza una máscara que selecciona qué genes
componen al hijo.</li>

<li>Aleatoria: Combina aleatoriamente los genes.</li>
</ol>
</div>
</li>

<li><a id="org95ad9b0"></a>Mutación<br />
<div class="outline-text-5" id="text-org95ad9b0">
<ol class="org-ol">
<li>Flipping: Cambia el gen usando una máscara.</li>

<li>Intercambio: Intercambiar dos genes aleatoriamente.</li>

<li>Inverso: Se toma una sección de genes y se invierte el orden.</li>
</ol>
</div>
</li>

<li><a id="org2db4678"></a>Reemplazo<br />
<div class="outline-text-5" id="text-org2db4678">
<ol class="org-ol">
<li>Generacional: Los descendientes reemplazan a los padres.</li>

<li>Fuerte: Se seleccionan aleatoriamente entre padres e hijos.</li>

<li>Débil: Selecciona entre padres e hijos a los más fuertes.</li>
</ol>
</div>
</li>
</ul>
</div>

<div id="outline-container-org0d98007" class="outline-4">
<h4 id="org0d98007">ONE MAX</h4>
<div class="outline-text-4" id="text-org0d98007">
<p>
\[f(x)=\sum_{i=1}^n x_i\]
</p>

<p>
Elegimos una población inicial, supongamos:
</p>

<p>
\[x_1=(0\ 1\ 0\ 1)\] | 2
\[x_2=(0\ 0\ 0\ 0)\] | 0
\[x_3=(1\ 0\ 1\ 1)\] | 3
\[x_4=(1\ 0\ 1\ 0)\] | 2
</p>
</div>
</div>
</div>

<div id="outline-container-orgc3e7f2b" class="outline-3">
<h3 id="orgc3e7f2b">Clase 27</h3>
<div class="outline-text-3" id="text-orgc3e7f2b">
</div>
<div id="outline-container-orgfe57888" class="outline-4">
<h4 id="orgfe57888">Agentes probabilísticos</h4>
<div class="outline-text-4" id="text-orgfe57888">
<p>
Se encuentran en un entorno no determinista, o estocástico.
</p>
</div>

<ul class="org-ul">
<li><a id="orgb651111"></a>Creencia<br />
<div class="outline-text-5" id="text-orgb651111">
<p>
Es una concepción de cómo puede estar el ambiente; puede
modificarse con más información.
</p>
</div>
</li>

<li><a id="orgcc79297"></a>Estado de creencia<br />
<div class="outline-text-5" id="text-orgcc79297">
<p>
Conjunto de creencias que tiene un agente sobre un estado.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org3b4f59e" class="outline-4">
<h4 id="org3b4f59e">Teoría de utilidad</h4>
<div class="outline-text-4" id="text-org3b4f59e">
<p>
El agente prefiere las acciones que tengan mayor utilidad.
</p>
</div>
</div>

<div id="outline-container-orgf00a726" class="outline-4">
<h4 id="orgf00a726">Teoría de decisión</h4>
<div class="outline-text-4" id="text-orgf00a726">
<p>
Incorpora la teoría de la utilidad junto con la probabilidad.
</p>

<p>
En ésta el agente va a buscar las soluciones que maximicen la
utilidad <span class="underline">esperada</span>.
</p>

<p>
\[MUE\]
</p>
</div>
</div>

<div id="outline-container-org548809f" class="outline-4">
<h4 id="org548809f">Probabilidad</h4>
<div class="outline-text-4" id="text-org548809f">
<p>
<b>Espacio probabilístico:</b> Es una 3-tupla \((\Omega,\mathcal{F},p)\) tal que:
</p>

<ul class="org-ul">
<li>\(\Omega\) es el espacio muestral</li>
<li>\(\mathcal{F}\subseteq 2^{\Omega}\) el conjunto de eventos</li>
<li>\(p:\mathcal{F}\rightarrow [0,1]\) una función de probabilidad.</li>
</ul>


<p>
<b>Variable aleatoria:</b> Es una función tal que
</p>

<p>
\[X:\Omega\rightarrow\mathbb{R}\]
</p>
</div>

<ul class="org-ul">
<li><a id="orgabac1e6"></a>Notación<br />
<div class="outline-text-5" id="text-orgabac1e6">
<p>
\[p(X=x)\]
</p>

<p>
donde \(X\) es la variable aleatorio y \(x\) es el valor de \(X\)
</p>
</div>
</li>

<li><a id="org1b43d58"></a>Propiedades de \(\mathcal{F}\)<br />
<div class="outline-text-5" id="text-org1b43d58">
<ol class="org-ol">
<li>\(\emptyset,\Omega\in\mathcal{F}\)</li>
<li>Si \(E\in\mathcal{F}\) entonces \(E^c\in\mathcal{F}\)</li>
<li><p>
\(\sigma\) aditividad. Si \(E_1,E_2,\ldots\subseteq\mathcal{F}\) entonces
</p>

<p>
\[\bigcup_{i=1}^nE_i\in\mathcal{F}\]
</p></li>
</ol>
</div>
</li>

<li><a id="org57ed533"></a>Propiedades de \(p\)<br />
<div class="outline-text-5" id="text-org57ed533">
<ol class="org-ol">
<li>\(p(\emptyset)=0\)</li>
<li>\(p(\Omega)=1\)</li>
<li>\(p(E)\geq 0\ \forall E\in\mathcal{F}\)</li>
<li><p>
\(\sigma\) - aditividad Si \(E_1,E_2,\ldots\subseteq\mathcal{F}\) tales que \(\forall i. i\neq j\rightarrow E_i\cap E_j=\emptyset\)
</p>

<p>
Se tiene que
</p>

<p>
\[p\left(\bigcup_{i=1}^n E_i\right)=\sum_{i=1}^np(E_i)\]
</p></li>
</ol>
</div>
</li>

<li><a id="org3b1b407"></a>Probabilidad Conjunta<br />
<div class="outline-text-5" id="text-org3b1b407">
<p>
\[p(E_1,E_2)=p(E_1\cap E_2)\]
</p>

<p>
\[p(E_1,\ldots,E_n)=p\left(\bigcap_{i=1}^nE_i\right)\]
</p>

<p>
Diremos que \(E_1\bot E_2\) son independientes si
</p>

<p>
\[p(E_1,E_2)=p(E_1)p(E_2)\]
</p>
</div>
</li>

<li><a id="orga6c326c"></a>Probabilidad condicional<br />
<div class="outline-text-5" id="text-orga6c326c">
<p>
\[p(X_1=x_1|X_2=x_2)=\frac{p(X_1=x_1,X_2=x_2)}{p(X_2=x_2)}\]
</p>

<p>
\[p(X_1=x_1|X_2=x_2,X_3=x_3,\ldots,X_n=x_n)=\frac{p\left(\bigcap_{i=1}^nX_i=x_i\right)}{p\left(\bigcap_{i=2}^nX_i=x_i\right)}\]
</p>
</div>
</li>
