content/notas/IA/Notas.org
**** Esperanza

     Es una estadística sobre una variable aleatorio $X$ con valores
     $x_1,\ldots,x_n$ tales que.

     \[\mathbb{E}(X)=\sum_{i=1}^np_X(x_i)x_i\]

*** Teoría de decisión

    \[\max\mathbb{E}[U(X)]\]

**** Redes bayesianas
     
***** Teorema de probabilidad total

      \[p(X_i=x)=\sum_{x_2}\cdots\sum_{x_n}p(X_1=x_1,X_2=x_2,\ldots,X_n=x_n)\]

** Clase 28

*** Redes Bayesianas

    Es un modelo gráfico que asocia variables aleatorias a nodos de la
    gráfica. Una arista implica una condición.

*** Muestreo por rechazo

    Es la inferencia sobre redes bayesianas.

    *Consultas con evidencia*: Tenemos que calcular la probabilidad de
    una variable dada una evidencia. Una evidencia es una asignación
    de valores a ciertas variables aleatorias.

** Clase 29

*** Inferencia Redes Bayesianas

    1. Muestreo por rechazo

       #+begin_src prog
function PRIOR-SAMPLE(bn)
	 x <- (x_1 x_2 ... x_n) ~ Inic 0
	 for x_1 in Order_top(bn.VARIABLES) do
	     x[i] <- RandomSample (x_i, p(X_i|Pi(X_i)))
	 done
	 return x
end
       #+end_src

       #+begin_src prog
function REJECTION-SAMPLING(bn, e, X_i, N)
	 C <- VETTOR(size=|X_i|) ~ Inic 0
	 for j=1 to N do
	     x <- PRIOR-SAMBLE(bn)
	     if x consistente con e then
	     	C[k] <- C[k] + 1 ~ i vlor de X_i en X
	 done
	 return Normalize(C)
end
       #+end_src

*** Ley de los grandes números

    Dadas las muestras $X_1,X_2,\ldots$ que convergen a $X$, entonces

    \[N\to\infty:\frac{1}{N}\sum_{i=1}^N X_i\longrightarrow\mathbb{E}[X]\]

*** Muestreo ponderado

    #+begin_src prog
function WEIGHTED-SAMPLE(bn, e)
    w <- 1
    x <- (x_1,...,x_n) ~ evento con elementos en e
    for i = 1 to n do
        if x in e then
	    w <- w * p (X_i=e_i|Pi(X_i))
	else
	    x[i] <- RANDOM-SAMPLE(X_i, p(X_i|Pi(X_i)))
	fi
    done
    return x, w
end
    #+end_src

    #+begin_src prog
function LIKELIHOOW-WEIGHTING(X, e, bn, N)
    w <- ZEROVECTOR(size=|X|)
    for j <- 1 to N do
        x, w <- WEIGHTED-SAMPLE(bn, e)
	W[k]<- W[k] + w
    done
    return NORMALIZE(W)
end
    #+end_src

** Clase 30
   

*** Agentes de aprendizaje

    - Aprendizaje: Un ajente se dice que aprende si su desempeño,
      medido con métrica $P$, en una tarea $T$, mejora con experiencia
      $E$.


    Por ejemplo, un agente que detecte spam:

    \[T=\] Clasificar correos en spam / ham

    $E=$ Correos (ya clasificados)

    $P=$ El número correcto de correos clasificados.

**** Entrenamiento y evaluación

     - Esquema 70 : 30

       - Toma 70% de datos originales

       - Toma 30% para evaluación

	 - 10% para validación; es decir, que estima hiperparámetros.

	 - 20% para evaluación

**** Hiperparámetros

     Son parámetros del modelo que no se aprenden, sino son determidaos
     por el programador.

**** Entrenamiento

     Consiste en convertir el problema de aprendizaje en un problema
     de optimización.

***** Función objetivo

      Sea $f$ un agente de aprendizaje

      \[\hat{f}=\text{arg}\,\text{min}R(f)\]

      donde

      \[R(f)=\mathbb{E}_{x\sim p(x)}[L(f(x),y)]\]

**** Evaluación

     - Supervisado:

       - Regresión

       - Clasificación

     - No supervisado

**** Regresión

     $f:X\rightarrow \mathbb{R}$

     1. Error cuadrático medio

       \[MSE=\frac{1}{N}\sum_{i=1}^N(y_i-f(x_i))^2\]

     2. Score $R^2\in[0,1]$

	\[R^2=1-\frac{\sum_x(y_x-f(x))^2}{\sum_x(f(x)-M_x)^2}\]

	donde $M_x$ es la media de los valores de salida $y$

** Clase 31

*** Aprendizaje supervisado
   
**** Algoritmos

     Regresión lineal: Encontrar una recta que mejor se ajuste a los
     datos.

     \[f(x,w,b)=w^T x + b\]

     Se tienen que obtener los parámetros $x, w, b$ tales que minimicen
     en el error.

     \[\varepsilon=f(x_i)-y_i\longleftrightarrow y_i=f(x_i)+\varepsilon\]

***** Funcion objetivo

      1. VAE: \[\frac{1}{N}\sum_{i=1}^N|y_i-f(x_i)|\]

      2. MSE: \[\frac{1}{N}\sum_{i=1}^N (f(x_i)-y)^2\]

	 \[\Rightarrow f^*=\text{arg\,min}_{f}\frac{1}{N}\sum_{i=1}^N(f(x_i)-y)^2\]
	 \[\Rightarrow w^*,b^* = \text{arg\,min}_{w,b}\frac{1}{N}\sum_{i=1}^N(w^Tx+b-y)^2\]

	 Para ello, derivamos e igualamos a 0

** Clase 32

*** Evaluación de clasificación

    - Matriz de confusión

    - Exactitud, precisión, exhaustividad

*** Clasificadores lineales

    1. Regresión logística
       
    2. Perceptrón

**** Regresión logistica

     \[\sigma(x)=\frac{1}{1+\exp\{-(wx+b)\}}\in[0,1]\]

     \[\sigma(x)=\mathbb{P}(y=1|x)\]

     Para obtener una clase

     \[\hat{y}=\text{arg\,max}_y\,\mathbb{P}(Y=y|x)\]

     \[\hat{y}=\text{arg\,max}_y\,\{\mathbb{P}(y=1|x),1-\mathbb{P}(y=1|x)\}\]

     Donde $x=(x_1,x_2,\ldots,x_n)$ es un vector de variables
     aleatorias.

     \[\hat{y}=\begin{cases}1 & \text{si }\sigma(x)>0.5\\ 0 & \text{En cualquier otro caso}\end{cases}\]

     * Regresión lineal: Es un modelo gráfico no-dirigido.
     
***** Función objetivo

      Siendo $x$ la entrada y $y$ su clase
      
      \[R(w,b)=-\sum_{(x,y)}y\ln(\sigma(x))+(1-y)\ln(1-\sigma(x))\]

***** Descenso por Gradiente      

** Clase 33

*** Clasificacion

    #+begin_src prog
Predict(x):
    f(x) <- 1 / 1 + exp(-wx+b)

fit(X,Y,eta,T):
    w, b <- RANDOM
    for t = 1 to T do
        for x, y in X, Y do
	    f(x) <- 1 / 1 + exp(-wx+b)
	    w_i <- w_i - eta(f(x)-y) x_i
	    b <- b - eta(f(x)-y)
    #+end_src

