notas/IA/Notas.html

<li><a id="orge6ec3cf"></a>Esperanza<br />
<div class="outline-text-5" id="text-orge6ec3cf">
<p>
Es una estadística sobre una variable aleatorio \(X\) con valores
\(x_1,\ldots,x_n\) tales que.
</p>

<p>
\[\mathbb{E}(X)=\sum_{i=1}^np_X(x_i)x_i\]
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org83ddcf4" class="outline-4">
<h4 id="org83ddcf4">Teoría de decisión</h4>
<div class="outline-text-4" id="text-org83ddcf4">
<p>
\[\max\mathbb{E}[U(X)]\]
</p>
</div>

<ul class="org-ul">
<li><a id="org97bb6b3"></a>Redes bayesianas<br />
<ul class="org-ul">
<li><a id="org2d4db5c"></a>Teorema de probabilidad total<br />
<div class="outline-text-6" id="text-org2d4db5c">
<p>
\[p(X_i=x)=\sum_{x_2}\cdots\sum_{x_n}p(X_1=x_1,X_2=x_2,\ldots,X_n=x_n)\]
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfe5d39c" class="outline-3">
<h3 id="orgfe5d39c">Clase 28</h3>
<div class="outline-text-3" id="text-orgfe5d39c">
</div>
<div id="outline-container-org65a99fc" class="outline-4">
<h4 id="org65a99fc">Redes Bayesianas</h4>
<div class="outline-text-4" id="text-org65a99fc">
<p>
Es un modelo gráfico que asocia variables aleatorias a nodos de la
gráfica. Una arista implica una condición.
</p>
</div>
</div>

<div id="outline-container-orge885a32" class="outline-4">
<h4 id="orge885a32">Muestreo por rechazo</h4>
<div class="outline-text-4" id="text-orge885a32">
<p>
Es la inferencia sobre redes bayesianas.
</p>

<p>
<b>Consultas con evidencia</b>: Tenemos que calcular la probabilidad de
una variable dada una evidencia. Una evidencia es una asignación
de valores a ciertas variables aleatorias.
</p>
</div>
</div>
</div>

<div id="outline-container-orgea0e9d5" class="outline-3">
<h3 id="orgea0e9d5">Clase 29</h3>
<div class="outline-text-3" id="text-orgea0e9d5">
</div>
<div id="outline-container-orgd55275f" class="outline-4">
<h4 id="orgd55275f">Inferencia Redes Bayesianas</h4>
<div class="outline-text-4" id="text-orgd55275f">
<ol class="org-ol">
<li><p>
Muestreo por rechazo
</p>

<div class="org-src-container">
<pre class="src src-prog">function PRIOR-SAMPLE(bn)
         x &lt;- (x_1 x_2 ... x_n) ~ Inic 0
         for x_1 in Order_top(bn.VARIABLES) do
             x[i] &lt;- RandomSample (x_i, p(X_i|Pi(X_i)))
         done
         return x
end
</pre>
</div>

<div class="org-src-container">
<pre class="src src-prog">function REJECTION-SAMPLING(bn, e, X_i, N)
         C &lt;- VETTOR(size=|X_i|) ~ Inic 0
         for j=1 to N do
             x &lt;- PRIOR-SAMBLE(bn)
             if x consistente con e then
                C[k] &lt;- C[k] + 1 ~ i vlor de X_i en X
         done
         return Normalize(C)
end
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orgfd2000b" class="outline-4">
<h4 id="orgfd2000b">Ley de los grandes números</h4>
<div class="outline-text-4" id="text-orgfd2000b">
<p>
Dadas las muestras \(X_1,X_2,\ldots\) que convergen a \(X\), entonces
</p>

<p>
\[N\to\infty:\frac{1}{N}\sum_{i=1}^N X_i\longrightarrow\mathbb{E}[X]\]
</p>
</div>
</div>

<div id="outline-container-orgc97ce25" class="outline-4">
<h4 id="orgc97ce25">Muestreo ponderado</h4>
<div class="outline-text-4" id="text-orgc97ce25">
<div class="org-src-container">
<pre class="src src-prog">function WEIGHTED-SAMPLE(bn, e)
    w &lt;- 1
    x &lt;- (x_1,...,x_n) ~ evento con elementos en e
    for i = 1 to n do
        if x in e then
            w &lt;- w * p (X_i=e_i|Pi(X_i))
        else
            x[i] &lt;- RANDOM-SAMPLE(X_i, p(X_i|Pi(X_i)))
        fi
    done
    return x, w
end
</pre>
</div>

<div class="org-src-container">
<pre class="src src-prog">function LIKELIHOOW-WEIGHTING(X, e, bn, N)
    w &lt;- ZEROVECTOR(size=|X|)
    for j &lt;- 1 to N do
        x, w &lt;- WEIGHTED-SAMPLE(bn, e)
        W[k]&lt;- W[k] + w
    done
    return NORMALIZE(W)
end
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2038cb5" class="outline-3">
<h3 id="org2038cb5">Clase 30</h3>
<div class="outline-text-3" id="text-org2038cb5">
</div>
<div id="outline-container-org4c5b3d7" class="outline-4">
<h4 id="org4c5b3d7">Agentes de aprendizaje</h4>
<div class="outline-text-4" id="text-org4c5b3d7">
<ul class="org-ul">
<li>Aprendizaje: Un ajente se dice que aprende si su desempeño,
medido con métrica \(P\), en una tarea \(T\), mejora con experiencia
\(E\).</li>
</ul>


<p>
Por ejemplo, un agente que detecte spam:
</p>

<p>
\[T=\] Clasificar correos en spam / ham
</p>

<p>
\(E=\) Correos (ya clasificados)
</p>

<p>
\(P=\) El número correcto de correos clasificados.
</p>
</div>

<ul class="org-ul">
<li><a id="org0581f71"></a>Entrenamiento y evaluación<br />
<div class="outline-text-5" id="text-org0581f71">
<ul class="org-ul">
<li>Esquema 70 : 30

<ul class="org-ul">
<li>Toma 70% de datos originales</li>

<li>Toma 30% para evaluación

<ul class="org-ul">
<li>10% para validación; es decir, que estima hiperparámetros.</li>

<li>20% para evaluación</li>
</ul></li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org2f28331"></a>Hiperparámetros<br />
<div class="outline-text-5" id="text-org2f28331">
<p>
Son parámetros del modelo que no se aprenden, sino son determidaos
por el programador.
</p>
</div>
</li>

<li><a id="org206726a"></a>Entrenamiento<br />
<div class="outline-text-5" id="text-org206726a">
<p>
Consiste en convertir el problema de aprendizaje en un problema
de optimización.
</p>
</div>

<ul class="org-ul">
<li><a id="orgc6a4c1a"></a>Función objetivo<br />
<div class="outline-text-6" id="text-orgc6a4c1a">
<p>
Sea \(f\) un agente de aprendizaje
</p>

<p>
\[\hat{f}=\text{arg}\,\text{min}R(f)\]
</p>

<p>
donde
</p>

<p>
\[R(f)=\mathbb{E}_{x\sim p(x)}[L(f(x),y)]\]
</p>
</div>
</li>
</ul>
</li>

<li><a id="orgc950c77"></a>Evaluación<br />
<div class="outline-text-5" id="text-orgc950c77">
<ul class="org-ul">
<li>Supervisado:

<ul class="org-ul">
<li>Regresión</li>

<li>Clasificación</li>
</ul></li>

<li>No supervisado</li>
</ul>
</div>
</li>

<li><a id="orgf31ba0e"></a>Regresión<br />
<div class="outline-text-5" id="text-orgf31ba0e">
<p>
\(f:X\rightarrow \mathbb{R}\)
</p>

<ol class="org-ol">
<li><p>
Error cuadrático medio
</p>

<p>
\[MSE=\frac{1}{N}\sum_{i=1}^N(y_i-f(x_i))^2\]
</p></li>

<li><p>
Score \(R^2\in[0,1]\)
</p>

<p>
\[R^2=1-\frac{\sum_x(y_x-f(x))^2}{\sum_x(f(x)-M_x)^2}\]
</p>

<p>
donde \(M_x\) es la media de los valores de salida \(y\)
</p></li>
</ol>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb6bacad" class="outline-3">
<h3 id="orgb6bacad">Clase 31</h3>
<div class="outline-text-3" id="text-orgb6bacad">
</div>
<div id="outline-container-org7fc9acf" class="outline-4">
<h4 id="org7fc9acf">Aprendizaje supervisado</h4>
<div class="outline-text-4" id="text-org7fc9acf">
</div>
<ul class="org-ul">
<li><a id="org25d7e0b"></a>Algoritmos<br />
<div class="outline-text-5" id="text-org25d7e0b">
<p>
Regresión lineal: Encontrar una recta que mejor se ajuste a los
datos.
</p>

<p>
\[f(x,w,b)=w^T x + b\]
</p>

<p>
Se tienen que obtener los parámetros \(x, w, b\) tales que minimicen
en el error.
</p>

<p>
\[\varepsilon=f(x_i)-y_i\longleftrightarrow y_i=f(x_i)+\varepsilon\]
</p>
</div>

<ul class="org-ul">
<li><a id="org4a0aa18"></a>Funcion objetivo<br />
<div class="outline-text-6" id="text-org4a0aa18">
<ol class="org-ol">
<li>VAE: \[\frac{1}{N}\sum_{i=1}^N|y_i-f(x_i)|\]</li>

<li><p>
MSE: \[\frac{1}{N}\sum_{i=1}^N (f(x_i)-y)^2\]
</p>

<p>
\[\Rightarrow f^*=\text{arg\,min}_{f}\frac{1}{N}\sum_{i=1}^N(f(x_i)-y)^2\]
\[\Rightarrow w^*,b^* = \text{arg\,min}_{w,b}\frac{1}{N}\sum_{i=1}^N(w^Tx+b-y)^2\]
</p>

<p>
Para ello, derivamos e igualamos a 0
</p></li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org23c8e87" class="outline-3">
<h3 id="org23c8e87">Clase 32</h3>
<div class="outline-text-3" id="text-org23c8e87">
</div>
<div id="outline-container-org9d32b3d" class="outline-4">
<h4 id="org9d32b3d">Evaluación de clasificación</h4>
<div class="outline-text-4" id="text-org9d32b3d">
<ul class="org-ul">
<li>Matriz de confusión</li>

<li>Exactitud, precisión, exhaustividad</li>
</ul>
</div>
</div>

<div id="outline-container-org348f359" class="outline-4">
<h4 id="org348f359">Clasificadores lineales</h4>
<div class="outline-text-4" id="text-org348f359">
<ol class="org-ol">
<li>Regresión logística</li>

<li>Perceptrón</li>
</ol>
</div>

<ul class="org-ul">
<li><a id="orgbf6c361"></a>Regresión logistica<br />
<div class="outline-text-5" id="text-orgbf6c361">
<p>
\[\sigma(x)=\frac{1}{1+\exp\{-(wx+b)\}}\in[0,1]\]
</p>

<p>
\[\sigma(x)=\mathbb{P}(y=1|x)\]
</p>

<p>
Para obtener una clase
</p>

<p>
\[\hat{y}=\text{arg\,max}_y\,\mathbb{P}(Y=y|x)\]
</p>

<p>
\[\hat{y}=\text{arg\,max}_y\,\{\mathbb{P}(y=1|x),1-\mathbb{P}(y=1|x)\}\]
</p>

<p>
Donde \(x=(x_1,x_2,\ldots,x_n)\) es un vector de variables
aleatorias.
</p>

<p>
\[\hat{y}=\begin{cases}1 & \text{si }\sigma(x)>0.5\\ 0 & \text{En cualquier otro caso}\end{cases}\]
</p>

<ul class="org-ul">
<li>Regresión lineal: Es un modelo gráfico no-dirigido.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org4ba75f4"></a>Función objetivo<br />
<div class="outline-text-6" id="text-org4ba75f4">
<p>
Siendo \(x\) la entrada y \(y\) su clase
</p>

<p>
\[R(w,b)=-\sum_{(x,y)}y\ln(\sigma(x))+(1-y)\ln(1-\sigma(x))\]
</p>
</div>
</li>

<li><a id="org086bcbe"></a>Descenso por Gradiente<br /></li>
</ul>
</li>
</ul>
</div>
</div>
